[{"body": "Here is a collection of all the questions and answers:\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60mnkw)\n>I am recent law school graduate. Despite graduating from a top school, I find myself unemployed with a large student loan debt burden. While I'm sure my immediate prospects will improve in time, it's difficult to be optimistic about the future knowing that my ability to live a productive life -- to have a fulfilling career, to buy a house, to someday raise a family -- is hampered by my debt and the bleak economic outlook for young people. I know that I'm not alone in feeling this way. Many of us are demoralized. Your 2008 campaign was successful in large part due to the efforts of younger demographics. We worked for you, we campaigned for you, and we turned out in record numbers to vote for you. What can I say to encourage those in similar situations as I am to show up again in November? What hope can you offer us for your second term?\n\nAnswer:\n>I understand how tough it is out there for recent grads. You're right - your long term prospects are great, but that doesn't help in the short term. Obviously some of the steps we have taken already help young people at the start of their careers. Because of the health care bill, you can stay on your parent's plan until you're twenty six. Because of our student loan bill, we are lowering the debt burdens that young people have to carry. But the key for your future, and all our futures, is an economy that is growing and creating solid middle class jobs - and that's why the choice in this election is so important. The other party has two ideas for growth - more taxs cuts for the wealthy (paid for by raising tax burdens on the middle class and gutting investments like education) and getting rid of regulations we've put in place to control the excesses on wall street and help consumers. These ideas have been tried, they didnt work, and will make the economy worse. I want to keep promoting advanced manufacturing that will bring jobs back to America, promote all-American energy sources (including wind and solar), keep investing in education and make college more affordable, rebuild our infrastructure, invest in science, and reduce our deficit in a balanced way with prudent spending cuts and higher taxes on folks making more than $250,000/year. I don't promise that this will solve all our immediate economic challenges, but my plans will lay the foundation for long term growth for your generation, and for generations to follow. So don't be discouraged - we didn't get into this fix overnight, and we won't get out overnight, but we are making progress and with your help will make more.\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60mom8)\n>What's the recipe for the White House's beer?\n\nAnswer:\n>It will be out soon! I can tell from first hand experience, it is tasty.\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60mnz9)\n>What are you going to do to end the corrupting influence of money in politics during your second term?\n\nAnswer:\n>Money has always been a factor in politics, but we are seeing something new in the no-holds barred flow of seven and eight figure checks, most undisclosed, into super-PACs; they fundamentally threaten to overwhelm the political process over the long run and drown out the voices of ordinary citizens. We need to start with passing the Disclose Act that is already written and been sponsored in Congress - to at least force disclosure of who is giving to who. We should also pass legislation prohibiting the bundling of campaign contributions from lobbyists. Over the longer term, I think we need to seriously consider mobilizing a constitutional amendment process to overturn Citizens United (assuming the Supreme Court doesn't revisit it). Even if the amendment process falls short, it can shine a spotlight of the super-PAC phenomenon and help apply pressure for change.\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60mmg8)\n>What was the most difficult decision that you had to make during this term?\n\nAnswer:\n>The decision to surge our forces in afghanistan. Any time you send our brave men and women into battle, you know that not everyone will come home safely, and that necessarily weighs heavily on you. The decision did help us blunt the taliban's momentum, and is allowing us to transition to afghan lead - so we will have recovered that surge at the end of this month, and will end the war at the end of 2014. But knowing of the heroes that have fallen is something you never forget.\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60mm2v)\n>What is the first thing you'll do on November 7th, win or lose?\n\nAnswer:\n>Win or lose, I'll be thanking everybody who is working so hard - especially all the volunteers in field offices all across the country, and the amazing young people in our campaign offices.\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60ml11)\n>How are you going help small businesses in 2013 and 2014? and what if any bills are you going to implement for small businesses, in 2013, and 2014?\n\nAnswer:\n>We've really focused on this since I came into office - 18 tax cuts for small business, easier funding from the SBA. Going forward, I want to keep taxes low for the 98 percent of small businesses that have $250,000 or less in income, make it easier for small business to access financing, and expand their opportunities to export. And we will be implementing the Jobs Act bill that I signed that will make it easier for startups to access crowd-funding and reduce their tax burden at the start-up stage.\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60mm5n)\n>Who's your favourite Basketball player?\n\nAnswer:\n>Jordan - I'm a Bulls guy.\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60mlwx)\n>We know how Republicans feel about protecting Internet Freedom. Is Internet Freedom an issue you'd push to add to the Democratic Party's 2012 platform?\n\nAnswer:\n>Internet freedom is something I know you all care passionately about; I do too. We will fight hard to make sure that the internet remains the open forum for everybody - from those who are expressing an idea to those to want to start a business. And although there will be occasional disagreements on the details of various legislative proposals, I won't stray from that principle - and it will be reflected in the platform.\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60mm41)\n>Are you considering increasing funds to the space program?\n\nAnswer:\n>Making sure we stay at the forefront of space exploration is a big priority for my administration. The passing of Neil Armstrong this week is a reminder of the inspiration and wonder that our space program has provided in the past; the curiosity probe on mars is a reminder of what remains to be discovered. The key is to make sure that we invest in cutting edge research that can take us to the next level - so even as we continue work with the international space station, we are focused on a potential mission to a asteroid as a prelude to a manned Mars flight.\n\nQuestion: [Link](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60mmaf)\n>How do you balance family life and hobbies with, well, being the POTUS?\n\nAnswer:\n>It's hard - truthfully the main thing other than work is just making sure that I'm spending enough time with michelle and the girls. The big advantage I have is that I live above the store - so I have no commute! So we make sure that when I'm in DC I never miss dinner with them at 6:30 pm - even if I have to go back down to the Oval for work later in the evening. I do work out every morning as well, and try to get a basketball or golf game in on the weekends just to get out of the bubble. Speaking of balance, though, I need to get going so I'm back in DC in time for dinner. But I want to thank everybody at reddit for participating - this is an example of how technology and the internet can empower the sorts of conversations that strengthen our democracy over the long run. AND REMEMBER TO VOTE IN NOVEMBER - if you need to know how to register, go to Gottaregister.com. By the way, if you want to know what I think about this whole reddit experience - NOT BAD!\n\n\nEdit: Added links.", "author": "Biinaryy"}, {"body": "How in the fuck was PresidentObama not already taken?", "author": "burnone2"}, {"body": "What are you going to do to end the corrupting influence of money in politics during your second term? ", "author": "suzmerk"}, {"body": "the title of this should have been obAMA", "author": "Natural_Karma_Police"}, {"body": "Mr. President, do you feel that there is a problem with the \"revolving door\" of congressmen and prominent lobbyists? For an example, I'd point to former Senator Dodd, now the chief lobbyist for the MPAA. Is there anything to be done about it?", "author": "nookrulz"}, {"body": "What was the most difficult decision that you had to make during this term?", "author": "FifthSurprise"}, {"body": "Would you rather fight 100 duck-sized horses or 1 horse-sized duck?", "author": "Reaverax"}, {"body": "[We know how Republicans feel about protecting Internet Freedom](http://mashable.com/2012/08/29/republicans-internet-freedom/). Is Internet Freedom an issue you'd push to add to the Democratic Party's 2012 platform?", "author": "SharkGirl"}, {"body": "The current US Patent system is hurting small businesses, in response the EFF has released [seven proposals for fixing the patents system](https://defendinnovation.org/). What plan does your administration have to address these issues?", "author": "rickdabunny"}, {"body": "Coming up: Tactful avoidance of marijuana questions and disappointment from /r/trees. ", "author": "Tropist"}, {"body": "What is the purpose of the embargo on cuba? will you consider lifting it? (Thanks for doing this AMA)", "author": "ormirian"}, {"body": "The moderators and admins have confirmed this thread; this is actually President Obama.\n\nEdit: [and he's confirmed via twitter](https://twitter.com/BarackObama/status/240903767350968320)", "author": "Drunken_Economist"}, {"body": "It's been stated that your favorite television show is The Wire. How do you think the war on drugs has affected America, and would you work to end it?", "author": "JrMint"}, {"body": "My question is this: Why would you sign the NDAA when it included language that would allow the indefinite detention of Americans without due process. I understand that this was the de facto case for awhile. Now it's law. This passed by overwhelming bi-partisan support, despite being hated by most citizens. It feels like the government, including the Executive branch, no longer work for the citizens that elect them. (By the way, I fully supported your first campaign, but I'm now disillusioned and disappointed.)", "author": "Joenothin"}, {"body": "What is the first thing you'll do on November 7th, win or lose?", "author": "daveforamerica"}, {"body": "I won't believe this unless he takes a picture with a shoe on his head.", "author": "Neural-Override"}, {"body": "Are you considering increasing funds to the space program?\n\nEdit: grammar", "author": "ormirian"}, {"body": "If you had the ability to automatically enact or repeal only one law without congressional approval, what would you choose and why?", "author": "CallMeBert"}, {"body": "I can confirm that this is indeed legit. ", "author": "hueypriest"}, {"body": "Mr. President,\nWhat are you doing about returning soldiers with PTSD, particularly those that have acquired various drug addictions.  I know there are a lot of VA facilities available, but they still have long waiting lists for the best inpatient programs.  I ask because of my brother, who did three tours in Iraq, was prescribed oxycodone for a wartime injury, and came back with a bad heroin addiction.  Please do more for these troops!  Thank you.", "author": "pepesgt"}, {"body": "Sir, do you anticipate the SEC convicting anyone for the massive banking and securities fraud that caused the 2008 financial crisis?", "author": "DaveMichael"}, {"body": "Your administration has been very quiet regarding Americans' issues with the TSA and their invasive security procedures. Your administration even [pulled](http://www.infowars.com/white-house-pulls-down-tsa-petition/) a petition regarding making them answer a court order regarding the naked scanners.\n\nDo you have any plans to reel in the over-reaching, rights-infringing bureaucracy the TSA has become?", "author": "thecw"}, {"body": "Marijuana prohibition has resulted in the arrest of over 20 million Americans since 1965, countless lives ruined and hundreds of billions of tax dollars squandered and yet this policy has still failed to achieve its stated goals of lowering use rates, limiting the drug’s access, and creating safer communities.\n\nIsn’t it time to legalize and regulate marijuana in a manner similar to alcohol? If not, please explain why you feel that the continued criminalization of cannabis will achieve the results in the future that it has never achieved in the past?", "author": "erikNORML"}, {"body": "Let's skip the marijuana legalization question that'll show up at least 50 times on this page and get to a related issue: After promising that you wouldn't interfere with individual state decisions on medical use of cannabis, how can you justify utilizing federal funds and agencies to shut down dispensaries and arrest people who are legitimately sick?", "author": null}, {"body": "How do you balance family life and hobbies with, well, being the POTUS?", "author": "gobearss"}, {"body": "Since this is the house that kn0thing built, let me ask a tech entrepreneurial questions.\n\n1. I just found out yesterday about the changes your administration has proposed for tax rates on C-Corps (dropping the rates to 28%).  Why isn't anybody talking about this?  I feel like this is something that you'd want to make sure to get across to folks in the entrepreneurial world!\n\n2. Does the democratic party know how much distrust it's sown through the SOPA/PIPA efforts?  I'm a staunch liberal, and made sure to call my congress critters over this issue.  Despite the extents to which your administration has done on awesome tech issues, SOPA/PIPA hit a really sour note for folks like me.", "author": "notheory"}, {"body": "President Obama - How can we help to increase the standard of debate in this country so that it's not simple soundbytes and broad generalizations of complicated problems?", "author": "georgegsmithjr"}, {"body": "What are you going to do in your second term to address the failed war on drugs?", "author": "eddieohare"}, {"body": "Hey, I'm a Canadian and I've always wondered what you thought about the Canadian health care system compared to the US health care system!\n\nThanks for doing an AMA!", "author": "coffeeholic91"}, {"body": "Mr President, are you concerned about the division the US has? Red and blue, christian and secular, pro-life and pro-choice... its become almost like a football rivalry where you want the other team to lose even if it is not in the benefit of anyone. \nWhat can be done to amend this?", "author": "pnothing"}, {"body": "Mr. President - What issues, if any, do you agree with Mitt Romney that are not commonly endorsed by the majority of the Democratic Party?", "author": "neonsnow"}, {"body": "Isn’t it time to legalize and regulate marijuana in a manner similar to alcohol? If not, please explain why you feel that the continued criminalization of cannabis will achieve the results in the future that it has never achieved in the past?\"", "author": "Cbakeractor"}, {"body": "What do you have to say about the drug war? Do you think it's a problem that millions of Americans are in jail for non-violent crimes?", "author": "pghgamecock"}, {"body": "In what ways will you attempt to make university a more affordable path for students?", "author": null}, {"body": "Are there any plans to reduce military spending throughout 2013/14 and put the money into other areas such as the space program or helping to overhaul the education and health care systems?", "author": "scnjedi"}, {"body": "Mr. President, you do realize you are going to break the Internet, right?", "author": "Fancer"}, {"body": "Who's your favourite Basketball player?", "author": "karlfranks"}, {"body": "Mr. President, when will the United States officially move to the [metric system](http://en.wikipedia.org/wiki/Metric_system)?", "author": "mthreat"}, {"body": "What's the recipe for the White House's beer?", "author": "silent1mezzo"}, {"body": "The landing of Curiosity on Mars shows Americans still care deeply about our space exploration efforts. What are your plans for NASA if you get re-elected?", "author": "meteorologygeek1"}, {"body": "With all the patent lawsuits taking place recently, it has become painfully obvious that the system needs revision. Action or inaction on this issue can affect innovation for years to come. How does your administration plan on dealing with this issue during the next four years if you are re-elected?", "author": "0accountability"}, {"body": "http://i.imgur.com/Ju94o.png", "author": "Shitty_Watercolour"}, {"body": "[deleted]", "author": null}, {"body": "If you had to select one non-politician to be the next president, who would be your pick?", "author": "Drunken_Economist"}, {"body": "Why do petitions keep disappearing from whitehouse.gov?", "author": null}, {"body": "Mr. President, can you stop the NHL Lockout? Please?\n\n\n\n**PLEASE????**", "author": null}, {"body": "President Obama, why didn't you close Guantanamo Bay as you promised you would?", "author": "sheabd01"}, {"body": "Mr. President, why did you insist on the continued imprisonment of Yemeni journalist Abdulelah Haider Shaye?  Is he being punished for revealing that it was a US Tomahawk missile that killed 14 women and 21 children in al Majala on Dec 17th 2009, not a Yemeni air strike as reported by the pentagon?", "author": "agitpropane"}, {"body": "[BO in third grade and now](http://i.imgur.com/126Nw.jpg)\n\nx-post from /r/PastAndPresentPics", "author": "NateTrib"}, {"body": "Why have you not gotten rid of the Patriot Act like you said you would?", "author": "Orion584"}, {"body": "why did you cave to continuing the war on drugs?", "author": "rvaen"}, {"body": "Will you come to my birthday party at McDonalds?", "author": "yuloforce"}, {"body": "What is in Area 51?", "author": "DrAvatar"}, {"body": "Hi", "author": "BladeNoob"}, {"body": "Why haven't you closed Guantanamo Bay?", "author": "pterrydactyl"}, {"body": "[deleted]", "author": null}, {"body": "A lot of us are worried about copyright law. Sopa, Acta, TPP... And the actions against Megaupload. Mainly because these laws are excessive and limit rights. What is your stance on that?", "author": "tauntology"}, {"body": "What is the number one misconception about yourself or your campaign that you wish you clear up.", "author": "dothefandango"}, {"body": "Why aren't you more actively fighting RNC voter suppression?", "author": "r0ckflite"}, {"body": "[deleted]", "author": null}, {"body": "Mr. President--Thank you for doing this!\n\nYou're likely to get a lot of questions about policy, and those are important; but I'm interested in hearing a story. Can you tell us about visiting a favorite town or location, anywhere in the world, and why the experience stands out in your memory?", "author": "katekatekate"}, {"body": "Would you be brave enough to do a Q&A with college students JUST on foreign policy and America's international role?", "author": "thereal_plaidavenger"}, {"body": "[deleted]", "author": null}, {"body": "You talk about wanting to protect internet freedom yet look at what your administration does\n\nhttp://www.huffingtonpost.com/2012/06/13/obama-trade-document-leak_n_1592593.html\n\nhttp://news.cnet.com/8301-31921_3-20043421-281.html\n\nhttp://www.techdirt.com/articles/20090313/1456154113.shtml\n\nWhy don't you tax the movie stars and celebrities and producers who make crap remakes and then earn millions a year for the rest of their lives? They are ones people should be angry at. The best they contribute to society is a short stress relief. Then they have the audacity to demand massive fines and law suits while they sit on millions because some one pirated one of their movies? That is a complete mutilation of intellectual property laws. Everyone knows that John Doe didn't create Avatar so why is he and other innocent bystanders getting hit so hard just because he watched it without paying $30 for it? ", "author": "mfcmaddogg"}, {"body": "Dear Mr. President\n\nYou responded to my little sister's letter once, thank-you for being an actively involved leader. It meant a lot to her. I am a first year medical student. I am worried about the debt I am taking on. I have read a lot about the healthcare bill and the student loan bill. I have also been hearing a great deal (from my professors and peers) about how America has the most expenditure on healthcare while being ranked rather low on our healthcare system. Is your bill the first step in a larger plan to remedy our failures in the system? I did not choose to become a doctor for money, but should I be worried that I will not have the opportunities that my father had once I get my MD, especially while the debt I took on is greater? Thank-you again for your time.\n\nSincerely,\nAmerican Boy from NY", "author": "Caesar619"}, {"body": "Stop asking questions.\n\nThis AMA ended.... A Month Ago.\n\nAlso, it even says \n>I’ll be taking your questions for half an hour starting at about 4:30 ET.\n", "author": "tissin"}, {"body": "I have an 11 year old and a 13 year old child. I currently pay more for them to go to private school for one year than I paid for my entire master's degree. \n\nWhat can you do to heal our very broken public school system (which I want to love)? What can I expect for them when they go to college in a few short years? ", "author": "JessicaGottlieb"}, {"body": "Why are we still in Afghanistan?", "author": "BackFire349"}, {"body": "What is being done to prevent future (and investigate past) tampering with election equipment?  There is some pretty damning evidence of vote tampering in 2004, most prominently in Ohio.  As a resident of Ohio in 2004, why should we even bother voting if our votes are filtered through Republican-owned data centers?\n\nEdit:  [Recent front-page link on Reddit](http://www.reddit.com/r/politics/comments/yxb2q/flashback_last_year_it_was_revealed_that_the_ohio/)", "author": "15blinks"}, {"body": "Mr. President : are you going to reach out to the Libertarians on some level to garner some votes on a few issues like pulling out of the middle east?", "author": "jblo"}, {"body": "Barack, I know you've received a lot of criticism for \"Obamacare\", and it may not be a perfect solution, but I think it's a step in the right direction. It has personally been a big help within my family.\n\nI lost my big sister to cancer exactly 3 months ago. If it weren't for some of the laws you helped create, she would have left her husband millions of dollars in debt. Because of those laws, she was able to fight it with every possible treatment we could find without worrying about where we would get the money.\n\nThank you. \n\nI only wish she could tell you that herself, she was very grateful for the chances she was given. My whole family is grateful. ", "author": "jamie79512"}, {"body": "Is there anything going to be done about the current state of student loans?", "author": "gobearss"}, {"body": "[deleted]", "author": null}, {"body": "What has been your favorite moment of your presidency?  The saddest? ", "author": "white_stone"}, {"body": "Have you ever seen EpicMealTime on YouTube? If so, do you like it?", "author": "HarleyMore"}, {"body": "Wow! Regardless of what anyone thinks politically, you can't say that our leader is not in touch.  Very impressive, Mr. President!", "author": "RickWino"}, {"body": "1) Why are you taking money from Wall Street and then your Justice department pardons Goldman Sachs?\n\n2) Why do you aid Israel (An apartheid country that lives on blood and money of Americans) ? Also explain how is Zionism not bigotry? (Actually any non-secular policy is bigotry)\n\n3) Why are you having a kill list and killing innocent people to make more terrorists? \n\n4) Why are you expanding US military presence abroad where it is not our business? \n\n5) Why are you supporting NDAA and extending the patriot act? \n", "author": "anirband"}, {"body": "As a small business owner, my biggest issue in expanding and hiring more people is the necessary funds to do so. What can be done to encourage banks to lend more to small businesses in order to encourage growth. Thank You.", "author": "thegamersfix"}, {"body": "[deleted]", "author": null}, {"body": "Well. This is a surprise.\n\nHow could you see your second term differing from the first in the sense of overall effectiveness with Congress? It's seemed as if the Legislature has made several attempts of yours mind-numbingly difficult to pull off -- could you see yourself playing hardball a bit more with the Republicans in Congress if you win a second term?\n\nAnd hey, thanks for doing an AMA. Good luck in November -- I'll be voting for you again in Tennessee, although the rest of the state will likely not... again...", "author": "lotictrance"}, {"body": "What is the plan for Gitmo Bay?\nand for marijuana legislation? ", "author": "Arlington_Ent"}, {"body": "Why does your administration raid so many state-approved medical marijuana dispensaries?", "author": "PreferedNomenclature"}, {"body": "Do you think it's justifiable to imprison or fine someone for a crime that doesn't involve violence against someone else? Has a family member or friend of yours ever been charged with a victim-less crime? Do you feel that was the most effective way to change their behavior?", "author": "Shalashaska315"}, {"body": "Dr. Obama, several months ago you rode your big 'ol bus through New Vienna, Iowa and waved at people on the street. I believe you waved directly at me as well, during this very presidential visit.\n\nDo you remember me? I was the guy with the hat.\n", "author": null}, {"body": "Hello Mr. President!\n\nIf you could take back one decision you have made in office, what would it be? ", "author": "ImHully"}, {"body": "Toilet paper - facing out, or facing in?", "author": "pikpikcarrotmon"}, {"body": "[deleted]", "author": null}, {"body": "How do you plan to provide support and improve education?  In particular how will you address issues in education such as, middle class college students at risk of burden from debt, and our K-12 system that is struggling from multiple funding cuts.", "author": null}, {"body": "What is your biggest regret about the 2 years where we had a Democratic president and a super-majority in the house and senate?", "author": "kilgoresalmon"}, {"body": "President Obama: What is one belief or principle about government that you want to let the Reddit community know that separates you from your political candidate, Mitt Romney? \nThank you for doing this AMA", "author": "TheDoBoy"}, {"body": "Hi, big fan here.  I've got two quick questions:\n\nDo you consider the War on Drugs to be a failure. Why or why not?\n\nAnd second, what do you say to the families of the US Citizens you've ordered droned to death by executive fiat, and how does such an order comport with your understanding of constitutional law.", "author": null}, {"body": "Hello, Mr. President!  Big fan. :-)  I'd like to know what you feel about what I think is a very under-talked-about issue...assisted suicide.  I'm 35 now, but when I'm older I don't want to suffer with some slow-moving cancer or other terrible, uncurable disease. It's a big fear and it's sad so many people have to die with so little dignity.\n\nWhat's your position?", "author": "ZaBlanc"}, {"body": "Mr. President, I am a resident of the District of Columbia.  It seems like voting rights for DC has been a ridiculously politicized issue, with Democrats generally in favor and Republicans generally opposed.  If you are re-elected President, what do you plan/hope to do to break through this stalemate and provide some basic level of elected representation to the 600,000 tax-paying citizens of the District?", "author": "jaybeas"}, {"body": "The republicans have included 'Audit the Fed' in their platform. Something that I agree with. Do you agree with this or plan to look into the Fed in your second term?", "author": "vicoesco"}, {"body": "President Obama. With everything that is going on around the world and our debt approaching 16 trillion dollars, don't you think it is time we stop the wars and close down at least half of our bases?", "author": "jkeith5484"}, {"body": "Is anyone else reading this in his voice?", "author": "billyz0914"}, {"body": "What, if anything, can you do to block the voter suppression measures in swing states like Pennsylvania?", "author": "kylerken"}, {"body": "I know he's no longer answering, but I feel this question should be higher up. Why are you allowing suppression of third parties? Obviously, a third party taking votes from you isn't your favourite idea, but shouldn't America have more than two choices?", "author": null}, {"body": "President Obama, I have two questions for you. While each are equally important to me, feel free to answer either one. I am a sixteen year old female planning on joining the Navy's nuclear propulsion program. If elected for a second term, what would you do to ensure that alternative energy is moving forward? I am asking this because after serving in the Navy, I would like to see a substantial growth in support and funding into the search for a cleaner and more efficient  energy source. Thank you in advance for taking the time and consideration to respond. \n\nNow for my second question. If faced with a sudden outbreak leading to the dead rising and attacking the living, what would you do? What is your zombie apocalypse plan? Once again thank you and I really hope that you get a chance to respond. Have a good day. :)\n", "author": "Laren_Marie"}, {"body": "Even though I know this post is late, and will most likely get buried and might never read it, I want to simply thank you for the Deferred Action Process. You have brought hope to me and my family. I promise to do something good for our country as well as to give back to those who need it. ", "author": "ranciddancer"}, {"body": "You know? I never would of imagined that I'd ever have a chance to interact with the President of the United States. I am appalled by the actions of the government, those on the campaign trail, and the companies that make the rich and powerful take precedence over the poor and weak. I am ashamed of a government dominated by supposed \"Christians\" that's agenda has been sending off our friends, siblings, and other relatives off to fight for the interests of corporations. I am ashamed of the desperate need to expand the size of our miltary forces instead of working to diminish the size of the military. I am upset that being an economic hitman is supposedly what is good for me as a member of the LGBT community and yet homelessness, poverty, and injustice strikes many LGBT people and threatens to destroy them. I am saddened by the fact that many people do not have homes and instead we have private prisons that uses inmates for cheap labor.\n\nYou know Mr. President? I was wanting to post something incredibly angry, but all I really want to know is what are you going to do to fix it?\n", "author": null}, {"body": "President Obama, if another country was treating a captured U.S. soldier the way that PFC Bradley Manning was treated in the brig at Quantico, VA (conditions deemed \"cruel, inhuman and degrading\" by UN Chief Rapporteur on Torture Juan Mendez), would you deem that acceptable and [appropriate](http://www.huffingtonpost.com/2011/03/11/obama-bradley-manning-tre_n_834669.html)?\n\n[Background Information](http://www.bradleymanning.org/news/call-for-action-at-obama-campaign-offices-nationwide-sept-6th-during-democratic-national-convention)\n\n", "author": "iStandWithBrad"}, {"body": "Are you happy?", "author": "SnoggingGandalf"}, {"body": "I'm a 25% owner in a small family business (125 emps). How do I convince my 3  partners that the local and sate chambers, business news about how much more Obamacare and Fed regs will cost us is BS? Some great infographics from your campaign team would be really helpful! ", "author": null}, {"body": "Hi Mr. President! Welcome to Reddit and thanks for taking the time to talk to us!\n\nSo a lot of people on Reddit say that there is little difference between you and Gov. Romney - I think the reason that they say this is mostly because of the wars in Afghanistan and overall military policy, and that's the place where people want to see the most change. \n\nMy question is this: what can we expect from you on this issue that we won't see from a Romney Administration, or what will be the key differences in your defense policy from Romney's?", "author": "scrabblydab"}, {"body": "If you could do one thing differently from your first term as President, what would it be?", "author": "jaybeas"}, {"body": "What were you thinking when you walked into the Oval Office for the first time as president? \n\n", "author": "redtaboo"}, {"body": "How do you feel about the republicans snubbing Ron Paul at the GOP convention?\n\n*fixt", "author": "beefsupreme"}, {"body": "Mr. President, I would like to ask a very simple and concise question: if reelected, would you take measures towards the legalization of marijuana - either recreationally or solely for medicinal use - on a federal level?", "author": "h3r4ld"}, {"body": "How did the \"blackout\" of websites like Reddit and Wikipedia affect the position of the administration on SOPA and PIPA?", "author": "Drunken_Economist"}, {"body": "Mr. President-\nHypothetically, if the United States had no debt, what would you spend money on?", "author": "gabmonty"}, {"body": "How much do you [YS Press?](http://www.youtube.com/watch?v=SK54Dv5ZQzg)", "author": null}, {"body": "Hi Barack, I am the Original Creator of Not Bad, Obama rage comic. \n\nDo you know it exists? \n\nhttp://29.media.tumblr.com/tumblr_lltzgnHi5F1qzib3wo1_400.jpg", "author": "joeyjoejoe99"}, {"body": "As a former constitutional law professor, can you explain how it is legal to kill an American citizen with a Predator drone without due process?", "author": "ccj"}, {"body": "I am recent law school graduate. Despite graduating from a top school, I find myself unemployed with a large student loan debt burden. While I'm sure my immediate prospects will improve in time, it's difficult to be optimistic about the future knowing that my ability to live a productive life -- to have a fulfilling career, to buy a house, to someday raise a family -- is hampered by my debt and the bleak economic outlook for young people. I know that I'm not alone in feeling this way. Many of us are demoralized. Your 2008 campaign was successful in large part due to the efforts of younger demographics. We worked for you, we campaigned for you, and we turned out in record numbers to vote for you. What can I say to encourage those in similar situations as I am to show up again in November? What hope can you offer us for your second term?", "author": "hmlee"}, {"body": "What is it like to award the Medal of Honor to someone? Do you guys have a beer and talk a little beforehand, or is it very formal?", "author": "moms3rdfavorite"}, {"body": "What are your thoughts regarding the media's reluctance to fact-check political statements for fear of accusations of bias?", "author": "Eyedrinker"}, {"body": "I look forward to seeing you in person again in Sioux City on Saturday.  Please address questions regarding marijuana policy.  It is time to legalize, tax and regulate.  Will you at least commit to reviewing this policy in the next four years?   ", "author": "SoDakLiberal"}, {"body": "Why do you think the majority of politicians are so slow on understanding and the proper use/etiquette of digital media? And do you feel you have a strong understanding of the medium, or do you rely heavily on experts around you?", "author": "banjoman74"}, {"body": "Are you worried about the precedent being set by extensive use of American drones over sovereign nations with which we are not at war? What happens when countries like Pakistan or Yemen get drone technology and try to use it over the US, citing our use of drones over their countries as examples?", "author": "YourCousinJeffrey"}, {"body": "What are you going to do to further LGBTQ rights in this country?", "author": "EeStew"}, {"body": "[deleted]", "author": null}, {"body": "Mr. President, first off thank you SO much from the bottom of my heart for your time for this!  This is so incredible!  You have already earned my vote!!!\n\nI have 2 simple questions for you!\n\n1. What is your plan to cut government spending?\n\n2. Since yesterday was the 40th anniversary of the War On Drugs, what is your stance on legalizing Marijuana?\n\nIf you respond to this, I will be so happy.", "author": null}, {"body": "What are your plans to increase scientific literacy in America? (The recent levels are worrying most of the EU citizens, including myself). I would recommend inspiring a new generation through space personally, with subsidiary education funding increases, but I do understand it is a bad economic situation for America (and the world) at the moment.", "author": "SaffyTheGeek"}, {"body": "Hello Mr. President,\nWith the increasing amount of attention being placed on the healthcare industry, do you have any plans to encourage tort reform? This seems to be the most overlooked solution to the problem of rising healthcare costs. \n\nSecondly, \nYou recently announced that you were a supporter of gay rights, but that it was a state issue. Gary Johnson gave you some flack for the remark, stating that human rights were a federal issue, and that no state should be able to keep rights away from its citizens. Have you put any thought into perhaps taking your support of the gay community a step further?\n\nThank you for your time; I can't say how exciting it is to see a high powered politician here taking questions from the people. \n\n-iron_cynic. ", "author": "iron_cynic"}, {"body": "Salutations commander in chief!\n\nMailman here. What are your solutions to the current financial problems facing the USPS, and what do you think it's role will be in the future?", "author": "malignantmop"}, {"body": "Why do you see the issue of marijuana legalization as a joke?", "author": "SEXM0NEYPOWER"}, {"body": "Hi Obama, I'll be honest. I don't like ALL of your economic policies but hey, I sure as hell don't want some douche who can't make up his mind most of the time running our country. ", "author": null}, {"body": "Why did you approve more draconian [Patriot Act](www.huffingtonpost.com/2011/05/27/patriot-act-extension-signed-obama-autopen_n_867851.html)", "author": "k3ksninja"}, {"body": "Why are people still asking questions? Its over guys!", "author": "njr123"}, {"body": "Well the leader of the free world has discovered reddit... Nothing productive will ever happen again ", "author": "Mofptown"}, {"body": "lol The AMA has been done for over 17 hours yet people are still leaving questions on here hahahah!!!!", "author": "3Dartwork"}, {"body": "Obama could say \"I had chicken for dinner last night\" and would get 2000 upvotes.", "author": "PlasmaBurns"}, {"body": "When's Half Life Three coming out?", "author": "mister_llama"}, {"body": "how can people downvote this?!?!", "author": "tailboys1"}, {"body": "> By the way, if you want to know what I think about this whole reddit experience - NOT BAD!\n\nhttp://i.imgur.com/VKN34.jpg\n\nHE KNOWS", "author": "aleowk"}, {"body": "He said he would do an AMA for 30 min. That looks like 30 min of answering questions.", "author": "delmar15"}, {"body": "http://i.imgur.com/jGYrf.gif", "author": "davidburns"}, {"body": "HE DA PRESIDENT HE GETS WAT NAME HE WANTS", "author": "GHETTO_TYME_TRAVELR"}, {"body": "I read awhile age that it was an inactive account; the moderators then took it, and gave it to him.", "author": null}, {"body": "This is by far the most important thing a president can do if they really want to make a change. And it's not just about elections. It's about how laws are made. How we govern ourselves. How we protect our future", "author": "joshuaglynn"}, {"body": "Money has always been a factor in politics, but we are seeing something new in the no-holds barred flow of seven and eight figure checks, most undisclosed, into super-PACs; they fundamentally threaten to overwhelm the political process over the long run and drown out the voices of ordinary citizens. We need to start with passing the Disclose Act that is already written and been sponsored in Congress - to at least force disclosure of who is giving to who. We should also pass legislation prohibiting the bundling of campaign contributions from lobbyists. Over the longer term, I think we need to seriously consider mobilizing a constitutional amendment process to overturn Citizens United (assuming the Supreme Court doesn't revisit it). Even if the amendment process falls short, it can shine a spotlight of the super-PAC phenomenon and help apply pressure for change.", "author": "PresidentObama"}, {"body": "[His response](http://i.imgur.com/gNOfx.jpg)", "author": "WillSnipeForPie"}, {"body": "http://gifrific.com/wp-content/uploads/2012/06/ryan-point-agree-the-office.gif", "author": "CLSmith15"}, {"body": "Please allow copyright terms to actually end at some point. A public domain is vital. Please do not allow Hollywood, Chris Dodd and the RIAA to write all copyright laws.", "author": "zeekjr"}, {"body": "I'm pretty sure I know why obama didn't answer this question.  \n\nI used to work for [Creative Artists Agency](http://en.wikipedia.org/wiki/Creative_Artists_Agency) and earlier this year on the same day that the FBI was getting DDOS'ed by Anonymous for the MegaUpload takedown, Vice President Biden was scheduled to come into our office.   \n\nThe whole office was locked down with secret service.   CAA is the most powerful company in entertainment and it was way too convenient for Biden to be meeting with the partners at the same time as SOPA.\n\nObama didn't answer this question because you don't even have to look as far as Senator Dodd.   Entertainment is on such great terms with the administration that the partners at the Agency didn't even need to fly to washington, the VP came to them.", "author": "caaThrowaway"}, {"body": "The decision to surge our forces in afghanistan.  Any time you send our brave men and women into battle, you know that not everyone will come home safely, and that necessarily weighs heavily on you.  The decision did help us blunt the taliban's momentum, and is allowing us to transition to afghan lead - so we will have recovered that surge at the end of this month, and will end the war at the end of 2014.  But knowing of the heroes that have fallen is something you never forget.", "author": "PresidentObama"}, {"body": "Thank you for getting NBC to televise this question. \n\nYou da man.", "author": "iceward"}, {"body": "Duck-sized horses sound incredibly cute.", "author": "FormerlyEAbernathy"}, {"body": "Hey! I saw this comment on TV! ", "author": "TheCornbread"}, {"body": "I want to hear how the Republicans would twist this question if he actually answered it.\n\n\"Obama is simply not a family man. He said it himself, he would 'kick the shit out of 100 duck-sized horses'. What kind of monster would fight such adorable animals?\"", "author": "_Chantastic_"}, {"body": "Internet freedom is something I know you all care passionately about; I do too. We will fight hard to make sure that the internet remains the open forum for everybody - from those who are expressing an idea to those to want to start a business. And although there will be occasional disagreements on the details of various legislative proposals, I won't stray from that principle - and it will be reflected in the platform.", "author": "PresidentObama"}, {"body": "And when you say \"Internet Freedom\" do you mean the Republican version (\"Freedom for the access provider monopoly\") or the version in which the Internet is free to anyone with an idea or an expression?", "author": "davidjoho"}, {"body": "I think we all knew that this issue would not be addressed. Though it is very important to many of us, his administration's stance on the issue does not shed a favorable light on their campaign and likely will not be addressed. ", "author": "RedtheIrish"}, {"body": ">tactful avoidance of marijuana questions, war on drugs questions, LGBT rights questions, not closing guantanamo bay as promised questions, NDAA questions...\n\n", "author": "tnuts420"}, {"body": "He talked about this prior to the 2008 election. His answer was the same populist \"We are going to hold the embargo to spread democracy and freedom\" bullshit thats been said by every president to uphold the criminal embargo, including McCain. \n\nThe embargo does nothing but hurt Cuba and its citizens by restricting beneficiary trade, and even much needed medical supplies that Cuba needs. Its been consecutively voted against by the UN by a vote of ~192-2 (being the US and Israel).\n\nThe mere fact that the Obama thinks that the US has the power to decide another country's well being on the guise of \"spreading democracy\", I think is quite telling, and why I much more prefer Ron Paul's views on American foreign policy. The US prior to the Cuban Revolution had supported the Batista dictatorship, as US investors had much stake in Cuban land. The embargo was hence initiated to protect American interests by immediately thwarting and disabling its socialist neighbor before it ever even had the chance. Later the CIA tried to overthrow Castro with multiple assassination attempts and an invasion, while decades later still aiding anti-Castro militants. The Cuban Five still remained jailed. Politicians like Obama have made such simple historical facts and opinions seem controversial and radical.\n\nHere is Amnesty's report on the impact of the embargo\nhttp://www.amnesty.org/en/library/asset/AMR25/007/2009/en/51469f8b-73f8-47a2-a5bd-f839adf50488/amr250072009eng.pdf\n\n\n", "author": "yourfaceyourass"}, {"body": "For proof, did he send you a picture of him holding a dated index card? Or did the Secret Service land a helicopter on your house?", "author": "demaney"}, {"body": "...wow.", "author": "qkk"}, {"body": "Welcome to Reddit, Mr. President.", "author": "TheAtomicPlayboy"}, {"body": "Haha, OP. I think you'll find it's President OP \n\nEDIT: I see what you did there.", "author": "Cooper0505"}, {"body": "Coolest president ever? Coolest president ever.", "author": "girlpart"}, {"body": "I'd like to second this question and add that, as a drug user, the fact that drugs are illegal has acted only to decrease the amount of money that I'm able to inject into our economy, instead I'm handing it over to Mexican cartels and other illegal operations. I would love to walk into a pharmacy and buy everything I'd like over the counter. I'm no less a productive citizen than I was before my drug use, but the cost of the drugs is just about the only thing presently endangering my said productive status. \n\n**EDIT: Answers to pretty much all questions and comments made in response to this post can be found [here](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60s1ki), [here](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60q7jy) and [here](http://www.reddit.com/r/IAmA/comments/z1c9z/i_am_barack_obama_president_of_the_united_states/c60n67z)**", "author": "GreatLookingGuy"}, {"body": "My primary concern as a medical marijuana patient in the state of California is how Obama has backtracked on his previous stance regarding state regulation & federal \"uninvolvement.\" To this day, many of the dispensaries I frequent have been raided by the DEA, guns drawn, and our meds have been taken away. It's unfair and it forces many patients back into the black market. I guess I'm just wondering if you plan to continue signing off on these malicious raids into your second term, or if you'd rather focus on much more pressing issues like our national debt, unemployment and the war in the middle east. (I'd like my friends back from Afghanistan.)", "author": "ttttori"}, {"body": "He'll never give a straight answer, if any at all", "author": "coldxrain"}, {"body": "Finally, I CTRL + F'ed \"NDAA\" and this is the only thing that came up. Don't expect this to be addressed at any point during the campaign, he's not going to try to defend it because it's indefensible.", "author": "zoso820"}, {"body": "Everybody PLEASE keep upvoting this! We were all PISSED with NDAA passing, now WE deserve a reason as to why this passed!", "author": "geganerd3"}, {"body": "This is why Obama doing an AMA was genius: he looks great and can pick and choose questions, claiming \"time\" when ignoring ones like this. ", "author": "HelluvaNinjineer"}, {"body": "Win or lose, I'll be thanking everybody who is working so hard - especially all the volunteers in field offices all across the country, and the amazing young people in our campaign offices.", "author": "PresidentObama"}, {"body": "Or a picture of him holding a cat with the caption \"I R THA PRESIDENT\"", "author": "ibetrollingyou"}, {"body": "but he also has to take a picture of himself taking a picture", "author": "SHAMPOO_IN_MY_VAGINA"}, {"body": "It seems like each new President brings a new direction to the Space Program. With Bush we got Constellation, and you brought us more of a focus on Science missions. Do you have the ability to give NASA the power to choose it's own direction and not be hampered by whatever the President and Congress are feeling like that day? \n\nLet me be clear, I love the direction that NASA is headed in currently but they could do so much for. I think that just as much as NASA clearly needs a larger budget, they need the power to use that budget effectively.", "author": "tsondie21"}, {"body": "Making sure we stay at the forefront of space exploration is a big priority for my administration. The passing of Neil Armstrong this week is a reminder of the inspiration and wonder that our space program has provided in the past; the curiosity probe on mars is a reminder of what remains to be discovered. The key is to make sure that we invest in cutting edge research that can take us to the next level - so even as we continue work with the international space station, we are focused on a potential mission to a asteroid as a prelude to a manned Mars flight.", "author": "PresidentObama"}, {"body": "As a girl about to finish my aerospace engineering degree- Please? I promise to spend my life creating the first black hole probe... You know you're curious too.", "author": "TheEden"}, {"body": "This is an awesome question, although potentially dangerous to answer.", "author": "TSDMC"}, {"body": "[deleted]", "author": null}, {"body": "How the hell did you guys pull this one off?", "author": "TheAtomicPlayboy"}, {"body": "I'd imagine this would be far more likely to get answered if you took out the sharp editorial in the last sentence. I too would like to hear the answer to this.", "author": "I_play_elin"}, {"body": "Good luck with an answer for this one. \nSo far the Obama administration has skirted this conversation at every turn. It's really the biggest flip-flop Obama has committed as president.", "author": "locke21"}, {"body": "Of course this goes unanswered. That REALLY infuriates me. Why does everyone in government just avoid this? Is there some secret reason they keep it illegal? God dammit that pisses me off to no end.", "author": "thisiscameron"}, {"body": "20 bucks says he doesn't address this", "author": "SunshineToss"}, {"body": "First of all, before I answer this question, I want you to know my credentials, such as they are.  I am a third year law student.  I am also a supporter of Marijuana reform.  I even got busted for felony possession w/intent to deliver a few years ago.  I also am heavily involved in politics, and run an organization that hosts events where paid speakers talk about issues of the day.  Earlier this year, our organization invited Drug Policy legal expert, Alex Kreit, to come talk about Marijuana and the Law.  I asked him the question that you are attempting to ask President Obama.  I will now paraphrase what he told us:\n\nObama does not have the amount of control over local federal authorities that your questions presupposes.  Obama *did* promise that he wouldn't interfere with individual state decisions on medical use of cannabis.  In fact, after being elected, his administration (specifically, Eric Holder, I believe) published the Ogden Memo (Google it).  This memo basically directed local federal authorities to respect the states with medical marijuana laws, and not prosecute anyone as long as they are not in violation of the state medical marijuana laws.  *However*, local federal authorities ignored the Ogden memo, and there was not much the Obama administration could do about it.  The way Alex Kreit put it was to say there are not many \"levers to pull\" for the Obama administration, and that the positions that the local federal authorities hold (U.S. Attorneys, for example) were specifically designed so as to maintain independence from central control.\n\nBasically, as a result of all this, it's not really accurate to blame Obama for the fact that local federal authorities are shutting down dispensaries and arresting people.", "author": "Change_Is_Constant"}, {"body": "As a secondary point, what role do you think states' rights (surrounding drug legalization) will play in the rest of your presidency? ", "author": "shadowofthe"}, {"body": "[deleted]", "author": null}, {"body": "It's hard - truthfully the main thing other than work is just making sure that I'm spending enough time with michelle and the girls. The big advantage I have is that I live above the store - so I have no commute! So we make sure that when I'm in DC I never miss dinner with them at 6:30 pm - even if I have to go back down to the Oval for work later in the evening. I do work out every morning as well, and try to get a basketball or golf game in on the weekends just to get out of the bubble. Speaking of balance, though, I need to get going so I'm back in DC in time for dinner. But I want to thank everybody at reddit for participating - this is an example of how technology and the internet can empower the sorts of conversations that strengthen our democracy over the long run. AND REMEMBER TO VOTE IN NOVEMBER - if you need to know how to register, go to Gottaregister.com. By the way, if you want to know what I think about this whole reddit experience - NOT BAD!", "author": "PresidentObama"}, {"body": "Jordan - I'm a Bulls guy.", "author": "PresidentObama"}, {"body": "Why did you include a link? Did you think he would not know what the metric system is?", "author": "Bloodfeastisleman"}, {"body": "It will be out soon! I can tell from first hand experience, it is tasty.\n\nEDIT (by staff): As promised http://www.whitehouse.gov/blog/2012/09/01/ale-chief-white-house-beer-recipe ", "author": "PresidentObama"}, {"body": "[deleted]", "author": null}, {"body": "This made it on CNN\n\nhttp://imgur.com/5zr6A", "author": "curly123"}, {"body": "The president must be so nervous right now...he just got a comment from shitty_watercolour.", "author": null}, {"body": "The truest, greatest honor he will ever receive. A SW portrait.", "author": "MaxIsAlwaysRight"}, {"body": "Hey Mr President, this guy is kinda a big deal around here. Respect him. Sir. ", "author": "TheDabbyDabby"}, {"body": "You should send the original to him. Sign it and it might end up on the president's fridge. ", "author": "IchthyoidPhalanges"}, {"body": "This thread is now complete. \n\nEDIT: Before this, my highest rated comment ever had 14 upvotes. ", "author": "Krall12"}, {"body": "[Welcome to Reddit](http://soundcloud.com/whynotbarbershop/welcome-to-reddit)", "author": "WhyNotBarbershop"}, {"body": "If it's not Louis C.K. or Neil deGrasse Tyson you've lost all of reddit's votes.", "author": null}, {"body": "He will need help from the Canadian prime minister.", "author": "goodBEan"}, {"body": "AND BRING THE WHALERS BACK TO HARTFORD ", "author": "brochak"}, {"body": "He signed an order closing it, and Congress denied funding to put it into effect.", "author": "aggie1391"}, {"body": "Specifically by persecuting people involved in state sanctioned medical marijuana programs ( which you and Holder promised your administration wouldn't do?). ", "author": "wtfusernametaken"}, {"body": "I hope he responds with something like, \"There's a **[COMMENT REDACTED]** along with a few **[EXPUNGED]**, plus a really cool **[CLASSIFIED]**.", "author": null}, {"body": "4chan servers, duh.", "author": "Cigajk"}, {"body": "[deleted]", "author": null}, {"body": "A walkway to Area 52.", "author": "Beard_on"}, {"body": "This question must be answered!", "author": "lemkepf"}, {"body": "He'll definitely answer this", "author": null}, {"body": "There's such a big feeling of that area with tumbleweed right now", "author": "ProneMasturbationMan"}, {"body": "hi", "author": "Dreoh"}, {"body": "Hey", "author": null}, {"body": "Because on foreign policy, Obama really has been Bush's third term. Glenn Greenwald, like always, has a [great article](http://www.salon.com/2012/07/23/the_obama_gitmo_myth/) going into why Obama didn't really want to close the injustices at Gitmo, but just transfer prisoners to the US.", "author": "Osterstriker"}, {"body": "Sorry.   This question is too real.\n\nMr. President, how do you eat your Oreos?", "author": "DiscerningDuck"}, {"body": "Yeah, because this is a fairly worded question on the issue", "author": "compto35"}, {"body": "It occurs on the state level, it's not his job.", "author": "Bring_dem"}, {"body": "to be fair, the DOJ has challenged a bunch of these laws in courts", "author": "brownmatt"}, {"body": "My mother is a public teacher. No Child Left Behind did not help. We need to ensure that our teachers get the support they need to be amazing and give a good education to students! Can you, Mr. President, make the job of \"teacher\" more prestigious, competitive, and reputable? ", "author": null}, {"body": "How about the tuition problem that's creating the loans?", "author": "starcastic"}, {"body": "He probably has something to promote. ", "author": "darknessthatisnot"}, {"body": "I'd like to see how he responds, given that there doesn't seem to be any set deadline for the closing of Guantanamo, nor has he definitively taken one side or the other on marijuana legislation.", "author": "DeathWalrus"}, {"body": "The answer will determine who I vote for come November ", "author": "scy1192"}, {"body": "They killed him? Jesus, they're getting pretty serious down there.\n\nEdit: To those just joining us, the comment above originally said *snuffing*. ", "author": "muddylemon"}, {"body": "Only reddit would make an IAMA being done by the President of the United States about Ron Paul.", "author": "rendevouspoo"}, {"body": "Probably doesn't care, like most of us", "author": null}, {"body": "I would think that if he were in favor of decriminalization of marijuana he would wait till after he is elected to make it known. It seems like it could be a risk. Saying nothing keeps it open without alienating people against it.", "author": "greenfan033"}, {"body": "Sorry somebody downvoted you.  You're alright.", "author": "0x0000ff"}, {"body": "Redditor for 2 hours. That's relevant.", "author": "whatever_right"}, {"body": "This account was made today and has never made another comment. This question was likely a plant.", "author": "omfglolzords"}, {"body": "Unfortunately you went to law school at a time when the job market for your prospective field was wildly oversaturated. I don't really feel like you can blame any politicians for that one.\n\nBest of luck finding a job, though.", "author": "shemperdoodle"}, {"body": "I'm gonna hate myself for this probably...\n\nYou've been a redditor for 2 hours. This account was started at the beginning of this ama. I would love to believe that you created this account for the purpose of asking Mr. President a question, but I am skeptical. You currently only have one comment on your account. Could you confirm with us that you aren't a presidential intern who made a question for the purpose of generating a popular response on reddit?\n\nI know I could easily get crucified for this, but the skeptic in me is suspicious.", "author": "zanderjh"}, {"body": "hmlee... Redditor for one day... asks serious question in a softball manner... POTUS answers.\n\nI'm calling shenanigans on this one.\n\nOne post... gets the President to answer, while still stroking the whole \"Obama is there for the young voters\" line.\n\nBS", "author": null}, {"body": "Something about choosing this question and its 1-day account echoes of \"Mister Burns, your campaign has the momentum of a runaway freight train.  Why are you so popular?\"", "author": null}, {"body": "The only post this person has gets answered by Obama and the account was made 3 hours ago? [Yeah, sure](http://media.tumblr.com/tumblr_lxioooM7Tj1qlah3d.png)", "author": "HecticBroccoli"}, {"body": "Was this your first post?.... I smell something fishy...", "author": "CalebEX"}, {"body": "[deleted]", "author": null}, {"body": "I understand how tough it is out there for recent grads. You're right -\nyour long term prospects are great, but that doesn't help in the short\nterm. Obviously some of the steps we have taken already help young\npeople at the start of their careers. Because of the health care bill,\nyou can stay on your parent's plan until you're twenty six. Because of\nour student loan bill, we are lowering the debt burdens that young\npeople have to carry. But the key for your future, and all our futures, is an economy that is growing and creating solid middle class jobs - and that's why the choice in this election is so important. The other party has two ideas for growth - more taxs cuts for the wealthy (paid for by raising tax burdens on the middle class and gutting investments like education) and getting rid of regulations we've put in place to control the excesses on wall street and help consumers. These ideas have been tried, they didnt work, and will make the economy worse. I want to keep promoting advanced manufacturing that will bring jobs back to America, promote all-American energy sources (including wind and solar), keep investing in education and make college more affordable, rebuild our infrastructure, invest in science, and reduce our deficit in a balanced way with prudent spending cuts and higher taxes on folks making more than $250,000/year. I don't promise that this will solve all our immediate economic challenges, but my plans will lay the foundation for long term growth for your generation, and for generations to follow. So don't be discouraged - we didn't get into this fix overnight, and we won't get out overnight, but we are making progress and with your help will make more.", "author": "PresidentObama"}, {"body": "this account is only 1 day old, suspicious much?", "author": "goonsquad96"}, {"body": "Novice account... Smells like ...", "author": "even_all_names_taken"}, {"body": "I'm sorry, but of all the questions, this one looks like the obvious plant.  A redditor for four hours, and your question reads like a talking points memo... so does the answer.", "author": "Deviant_Tech"}, {"body": "Redditor for 5 hours.  Just like the president. ", "author": "BaobhanSith"}, {"body": "Redditor for 20 hours, post made exactly 20 hours ago, and the President has a long well thought out response to your question.......seems fishy", "author": "Draft_Punk"}, {"body": "Hey, bet it's super cool being answered by the President! That was a great question, too, striking a chord with struggling young Americans, reminding everyone that Obama's been largely supported by young Americans, and especially that softball at the end, \"What hope can you offer us?\"\n\nOne question though, why is this brilliant comment from a reddittor who just made an account right before this AMA?", "author": "The_Future_Is_Now"}, {"body": "Redditor for 2 hours. That's relevant.", "author": "whatever_right"}, {"body": "HMLEE is a brand new user. Hmmmm", "author": "bobconan"}, {"body": "I never really understood this. Are you unemployed because you can't find the dream job you thought you were going to get? Or are you unemployed because there is absolutely no place where you could possibly be qualified to work with a law degree?", "author": "KeithHopkin"}, {"body": "> What **more** are you going to do to further LGBTQ rights in this country?\n\nFTFY.", "author": "footnotefour"}, {"body": ">The recent levels are worrying most of the EU citizens\n\nNo they're not.", "author": null}, {"body": "If you take the test and break it down demographically Americans have the highest science literacy race. What really bothers me is the low literacy and employment rates of the EU.", "author": "lawlamanjaro"}, {"body": "No mean to be rude or anything but, why is reddit so horny for space? I mean, there's plenty of other branches which are just as interesting and exciting. I know it's like space is like the great unknown, but there are other \"unknown\" things as well such as just why are things as they are? Why does the world work like it does? I love space as much as the next guy but I just don't understand reddit's obsession with it.", "author": "Goosish"}, {"body": "Shit tier troll 0/10", "author": "red_firetruck"}, {"body": "I'm ashamed our president didn't address a Redditor from the master race. In other words, congratulations on the Mars Rover, Europe.", "author": "droxile"}, {"body": "Knowing Reddit, this should be the very top comment.", "author": "codyt321"}, {"body": "I just laughed so fucking hard.", "author": "sbsheppy"}, {"body": "He's the president, he knows everything... Like Jesus.", "author": "PopsicleJane14"}, {"body": "I am a Canadian.... Just want to say that George Bush took 8 years to wreck your country... You should give Obama 8 to fix it.... ", "author": "BigbearBearstein"}, {"body": "Holy- I didn't think about it like that until you pointed it out. ", "author": "Confugo"}, {"body": "… his staffers do, anyway. Did you see the ‘meme’ on Obama’s campaign site: “Is president of the USA” / “does AMA” — oh, wow, they sure got ‘that internet thing’ figured out.", "author": "t822"}, {"body": "I'm actually surprised he was able to answer *any* questions after breaking Reddit.", "author": "4TEHSWARM"}, {"body": "Not to mention the site issues. It still took me a while to get to this post hours after it was supposed to have finished.", "author": null}, {"body": "I suspect that, of all people on the planet, the POTUS has the tighest managed schedule. I'm sure his handlers are like pitbulls regarding his access, scheduling, and keeping him on time for his next appointment.", "author": "dbcanuck"}, {"body": "There are dignitaries of foreign countries that would be willing to give a small fortune to get 30 minutes with POTUS, instead he decided to hang out with us on a website where the main draw is cat pictures and ridiculous memes.", "author": "ShallowPedantic"}, {"body": "Said \"what the hell is wrong with this guy?\" Looked at username. Oh.", "author": "CumNuggetz"}, {"body": "Mr President,\n\nThis is quite possibly the most important issue in American history. The way our voting system works today means that only those with the most money get their voice heard, and those who can't pander to the large spenders will not.  The only way to truly fix the election system is for PUBLICLY FUNDED ELECTIONS.  Elections should not be about who is best at gathering money, but who has the opinions and goals that he people want, these two are not, and should not be one in the same.  ANY donation should be considered a bribe.  All candidates should get EQUAL air time, all candidates should get EQUAL money to spend as they will on advertisements and their campaign, all candidates should have an EQUAL chance to be heard across the nation, regardless of how rich they are, or their friends.  The only way to have a true representative democracy is through a system like this.  Until this happens money will always influence elections in a way that is NOT beneficial to the people.  How can the people EVER trust their government knowing they are constantly taking bribes from the wealthy.  Fix this ONE issue and 90% of the other issues about corruption will slowly fade away.  I implore you, PLEASE do something about this!  Simply creating some minor law about capping donations and such is simply not enough.\n\nI don't know if you will even see this as this conversation is already over, but one can only hope...", "author": "Thithyphuth"}, {"body": "The Disclose Act is insufficient. I urge you to support Rep. John Dingel's [Restoring Confidence in Our Democracy Act](http://thomas.loc.gov/cgi-bin/query/z?c112:H.R.6310:). It is based on Lawrence Lessig's idea of [how the the government might circumvent the Citizen's United ruling](http://www.scribd.com/doc/101964239/Letter-to-Senator-Blumenthal-from-Lawrence-Lessig) without requiring a constitutional amendment. Surely it is more likely that Congress would pass a bill of this kind than it is that we ratify a constitutional amendment. \n\nI enthusiastically supported you in '08 but am lukewarm on you now. Support for the Restoring Confidence in Our Democracy Act would be a strong sign that you are serious about reforming the influence of special interests, an issue that I (and I think many others) believe is the single most important issue facing our country. Despite my disagreements with your administration, campaigning for this bill would guarantee my support for your reelection. ", "author": "stadiumseating"}, {"body": "who is giving to whom*", "author": "hijinked"}, {"body": "I was picturing [this response](http://i.imgur.com/a9Ex5.gif).", "author": "raintheory"}, {"body": "That's disturbing. The entertainment industry is trying very, very hard to save itself by whatever means necessary when all they have to do is innovate.", "author": "redditisfun"}, {"body": "Get us out of there. Place is a damn nightmare.", "author": "mrautomatic17"}, {"body": "These would be rabid and out to kill.", "author": "nooneelse"}, {"body": "I saw it on reddit, as a picture of it on TV.", "author": "Black_Apalachi"}, {"body": "Then why did you [sign ACTA](https://www.eff.org/issues/acta/)?", "author": "AskObama"}, {"body": ">internet remains the open forum for everybody\n\nI don't think we're worried about it being open.\n\nI think we're worried about our government taking away our privacy and unbiased access.\n\nWhat do you say about that?", "author": null}, {"body": "This is a very hard thing to believe in light of what you unleashed against Wikileaks. I am not talking about Assange's prosecution, I am talking about wikileaks being cut from Amazon, Visa, Mastercard, Paypal, and being erased from ICANN registers.\n\nHow do you reconcile these actions with your passion for internet Freedom?", "author": "keepthepace"}, {"body": "Sure thing. Do you like cats?", "author": "ordinaryrendition"}, {"body": "And you've been quoted in a mainstream Uk paper. Fair play to you. \n\nhttp://www.telegraph.co.uk/news/worldnews/us-election/9507620/President-Obama-makes-online-appearance-on-Reddit.html", "author": "AJER_AJER"}, {"body": "He faxed a copy of his birth certificate.", "author": "yishan"}, {"body": "[deleted]", "author": null}, {"body": "I'm surprised the username PresidentObama was even available. Or is the man powerful enough to just take it over anyway? I'd hate to see the leader of the free world reduced to taking a username like TheRealPresidentObama or POTUS69 or xx_BarackObama_xx or something.", "author": "South_Dakota_Boy"}, {"body": "9 minutes and already 200+ comments.\n\nGood luck, Obama. You're going to need it.", "author": "KoreanTerran"}, {"body": "Hey Mr. Obama, can you tell us something we're not supposed to know?", "author": "Bowmore"}, {"body": "ONE OF US. ONE OF US.", "author": null}, {"body": "POP :)", "author": "sabataco"}, {"body": "[deleted]", "author": null}, {"body": "http://m.quickmeme.com/meme/3qow02/", "author": "Cruel_cruel_cruel"}, {"body": "You must have enormous balls to admit you do illegal drugs on the one thread that the FBI is definitely monitoring.", "author": "sml6174"}, {"body": "Indeed, prohibition is an insidious strain on the economy.\n\nIt matters not whether one has a healthy relationship with a substance - prohibition means that each and every drug user, rich and poor, spends a great deal of money in an economy that does nothing except move around these prohibited substances.\n\nIt's simply wasteful.", "author": "pyrkne"}, {"body": "I have Crohns and marijuana reduces my symptoms and gives me a better quality of life, I'm more productive", "author": "questionsofscience"}, {"body": "I'll take that as \"Poppin bottles of Cristale like it's 1969\"", "author": "felatedbirthday"}, {"body": "This is what all of our second grade teachers warned us about. \"Learn to spell well, one day you may be spelling to the President!\"\n\n*Edit: to clarify, the comment above me originally referred to the top comment above **it**, in which there was a misspelling of the word \"increasing\". The comment was subsequently edited into an articulate query, probably after seeing that the other comment had hit the top and would almost surely be seen by the president. The first comment contained the typo to which I was referring.*", "author": "havestronaut"}, {"body": "> Let me be clear\n\nYou just Obama'd Obama.", "author": "cupofchupachups"}, {"body": "I love Obama, but I have to say, this is a true politician's response. He didn't ask for inspiring words about the successes of our space program, he asked if we are increasing their budget. I didn't see the words \"Yes\" or \"No\" anywhere in that response...", "author": "khaelian"}, {"body": "tl;dr \"no\"", "author": "akubar"}, {"body": "Respectfully, Mr. President, this is a non-answer. We've seen over the years what an economic boost having a robust space program can be -- not only does it create jobs, it inspires and gives the country focus on a positive and meaningful goal. The current budget for NASA is a pittance - think what could be done with double, or triple that amount?\n\n**Frankly, we need another Apollo moment, Mr. President -- let's plan to get a man on Mars by the end of the decade, and show the world that America is the most scientifically advanced and capable nation in the world, and can achieve what it sets out to do.**", "author": "peteyH"}, {"body": ">a asteroid\n\nan asteroid, Mr. President.", "author": "s0crates82"}, {"body": "As a guy with an aerospace degree, i regret to inform you that you'll never be in a position where that could happen", "author": "jag0007"}, {"body": "not stupid, this is a solid question", "author": "TbroOnline"}, {"body": "I suspect the latter partially due to: http://www.c-span.org/Events/President-Obama-to-Campaign-in-Virginia/10737433523-3/\n\nI've held a similar 'live chat' with the UK equivalents, and they all had people typing for them. Not word for word, but they would actually input on some things.", "author": "Magnum_Opus"}, {"body": "This is reddit. You all pulled this off by becoming the front page of the internet.\n\nedit: I'm also hoping the administration was so responsive because secretly they're all redditors.", "author": "kn0thing"}, {"body": "Reddit's getting bigger; the president wants publicity for his upcoming campaign.", "author": "sexrockandroll"}, {"body": "Under Obama, I believe crackdowns on medical marijuana dispensaries has increased.", "author": "dontpan1c"}, {"body": "This was the biggest flip flop he committed as a senator/candidate:\n\nhttp://www.politifact.com/truth-o-meter/article/2008/jul/14/obamas-wiretapping-flip-flop-yes/", "author": "go1dfish"}, {"body": "yeah actually there is. the pharmaceutical companies are paying millions to the politicians to keep it illegal.", "author": "shpongled7"}, {"body": "He's too busy answering questions about beer and basketball. ", "author": null}, {"body": "He answered 8 questions in 30 minutes. It's over", "author": "4rch"}, {"body": "Alex Kreit here.  Someone just let me know about this thread.  Thanks for the plug.  Just wanted to clarify that my comments were specifically about the ability of the Obama admin to try to encourage compliance with the Ogden memo.  Rob Mikos has published a fairly thorough <a href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1768127\">law review article</a> that discusses this issue and explains why the Ogden memo did not really provide any protection. \n\nThat said, it is also important to recognize that Obama could have done other things on this issue but hasn't.  For example, Obama could have picked better appointees--particularly to head the DEA.  He chose extremist drug warrior and Bush holdover Michele Leonhart for the job.  As some may remember, this summer Leonhart refused to admit that heroin and crack are more dangerous than marijuana.  Obama certainly could have made a better pick for the position.  He could have asked prospective nominees point-blank if they would honor the Ogden memo.  Instead, by nominating Leonhart, he all but guaranteed that the Ogden memo would be ignored by the DEA.  I think that the willingness of US Attorneys to ignore the Ogden memo also speaks poorly to them as appointees.  I think a fair US Attorney would have tried to honor Ogden's memo in good faith, even if he or she wasn't obligated to follow it.  Clearly, many of them simply ignored it.  Obama's administration could also have supported one or more of the congressional proposals to protect state medical marijuana laws.  To my knowledge, they've done nothing to back these proposals.  The list could go on.  \n\nSo, are President Obama and Eric Holder spearheading a coordinated strategy against medical marijuana?  I don't think there's any evidence of that.  I believe people who think otherwise may not have a full understanding of the relationship between the DOJ in DC and local federal law enforcement (again, Rob Mikos discusses this relationship in his excellent article.)  My best guess is that Holder genuinely hoped people would comply with the Ogden memo.  I imagine that Obama himself has probably given this issue hardly any attention (certainly he seems to do everything he can to avoid talking or thinking about this issue based on the lengths he goes to to ignore drug policy questions in public forums.)  But, are Obama appointees like Michele Leonhart and local US Attorneys cracking down on medical marijuana?  Obviously they are.  And, if Obama had nominated people who agreed with the Ogden memo in the first place, then there would never have been an issue about compelling compliance with it.    \n\nAnyway, those are only brief thoughts--it's impossible to convey all the nuances in an internet comments thread.  :)  But, I figured I would chime in to clarify the referenced comments of mine a bit.   ", "author": "akreit"}, {"body": "The meme has become self aware. ", "author": "Camusforyou"}, {"body": "http://memepics.com/wp-content/uploads/2011/10/obama-not-bad-campaign-poster.jpg", "author": "badbadpet"}, {"body": "Ladies and gentlemen: the President of the United States of America referencing his meme.\n\nGood night and God bless.", "author": "ChildofTime617"}, {"body": "The president has seen the meme. Our greatest hour has arrived.", "author": null}, {"body": "[I See what you did there!](http://29.media.tumblr.com/tumblr_lltzgnHi5F1qzib3wo1_400.jpg)\neverybody, the president gets our inside jokes; stay cool.\nEdit: Thank you for the kind [words about Reddit](http://rlv.zcache.com/oh_stop_it_you_wrapped_canvas-r3370958182ed42b788dcef6fe1cb1542_29c92_400.jpg) and for answering a handful of questions from We the People. ", "author": "OMGitzSARS"}, {"body": "He did the thing!", "author": "SamuraiSteev0h"}, {"body": "\"- NOT BAD!\"\n\n\nIt was at this point, Reddit ejaculated in glorious unison.", "author": "drps"}, {"body": "I was pissed it was over so soon then I realized there might be other important things he has to take care of...", "author": "teamgonuts"}, {"body": "Best ending comment ever.", "author": "DGOJG"}, {"body": ">whole reddit experience - [NOT BAD!] (http://www.quickmeme.com/meme/3qorh7/)\n\nftfy", "author": "datLoser"}, {"body": "[Gottaregister.com](https://gottaregister.com/)", "author": "davidjayhawk"}, {"body": "NEXT ON FOX NEWS: DOES BARACK OBAMA NEGLECT HIS DUTY AS A PRESIDENT, SPENDING HIS TIME PLAYING GOLF IN THIS ECONOMIC STATE? STAY TUNED.", "author": "omegachild"}, {"body": "Thank you for stopping by to let us ask questions of you. This was awesome. \n\nBut please do revisit this page at some point. The reddit format tends to percolate a bit. It takes a couple hours for the really good questions to rise to the top. As time goes by, it can really increase the anticipation that people have for the important questions. If you answer a few more, even if they're short responses, it will really create a huge impact around here.", "author": "HotwaxNinjaPanther"}, {"body": "Guys. Guys. He threw his own meme back at us. Guuuuys. ", "author": "Smokeymirror"}, {"body": ">NOT BAD\n\n\nI...I...I don't know what to say, sir.", "author": "lazerllama10"}, {"body": "http://i.imgur.com/b75WH.png", "author": "svenne"}, {"body": ">I never miss dinner with them at 6:30 pm \n\nPosting this information on the internet probably just increased your Secret Service detail at dinner time.", "author": "prettywannapancake"}, {"body": "Thanks, Mr. President. Insightful comment or not, let the internet record show that I responded to the President.", "author": null}, {"body": "damn right you are\n\nedit: ...sir.", "author": "ivanvzm"}, {"body": "Links to relevant information; gets bitched at.", "author": "TheThomaswastaken"}, {"body": "http://www.quickmeme.com/meme/3qop0b/", "author": null}, {"body": "So honoured that the President of the United States has responded to a question I asked him.", "author": "silent1mezzo"}, {"body": "Obama approved beer. The best around.", "author": "emq11"}, {"body": "President Brobama", "author": null}, {"body": "This AMA was totally worth it for this answer alone.", "author": "nklotz"}, {"body": "Hope it's called \"Ale To The Chief\"", "author": "y00tz"}, {"body": "As the President of the United States of America, I find this funny.", "author": "AsA___IFindThisFunny"}, {"body": "He should count his blessings. I'm quietly relieved the top comment isn't from POTATO_IN_MY_ANUS.", "author": "Phydeaux"}, {"body": "\"omgomgomgomgomg!!! THE Shitty_Watercolour!\"\n\n-Leader of the Free World", "author": "bob_newman"}, {"body": "That answer is extremely misleading.\n\nThe funds were denied in large part because Obama's plan was to close Guantanamo without ceasing the policies which made Guantanamo objectionable.\n\nUnder Obama's plan, Guantanamo detainees likely would have been shipped to the US, where their trial-free detention would continue.\n\nIn many ways, that would be an even worse situation.  Trial-free detention would be much more strongly established as an \"acceptable\" practice, especially if we had prisons like the one at Guantanamo Bay hosted within the United States itself.\n\nEven Congressional Democrats like Feingold -- someone who had strongly opposed the prison camp at Guantanamo and related policies -- voted to deny funds for Obama's plan.  They opposed his plan for the very reasons stated above.\n\nAnd as proven by the Obama administration's continuing efforts to punish the current Guantanamo detainees far beyond the call of duty, any efforts by his administration to close the Guantanamo prison camp have been for show only.\n\nGlenn Greenwald wrote a good summary of this subject, which you can read here:\n\nhttp://www.salon.com/2012/07/23/the_obama_gitmo_myth/\n", "author": "circulate"}, {"body": "Please answer this question!", "author": "CDUBZZZZ"}, {"body": "Hello", "author": "hestonkent"}, {"body": "UGH. I hope it's not some kind of fucking cologne or miracle supplement. ", "author": "weekendofsound"}, {"body": "What? Oh, you meant hmlee. Carry on.", "author": "redditor-for-2-hours"}, {"body": "I love that the President's reply to hmlee is now in fifth place.", "author": "doshka"}, {"body": "[removed]", "author": null}, {"body": "Hitmonlee. That is all.", "author": "narwhalcares"}, {"body": "Every week in the ABA journal 'Grads finding it hard to get jobs, etc etc etc.'", "author": "KnowsTheLaw"}, {"body": "Exactly. People have to do the research.\n\nCollege isn't a golden ticket. Trade schools and other avenues need to be given as options to High School students, too.", "author": null}, {"body": "While there is some truth to this, it’s an oversimplification. At top law schools (here I’m referring to the T14 - the 14 schools that stay at the top of the *U.S. News* rankings and occasionally change spots with one another), you are provided with statistics and testimonials to suggest that, whereas you might be taking an unjustified risk if you go to a lower-ranked school, there are always lots of options for the “cream of the crop” – i.e., everyone who goes to a T14 school.\n\nMy class enrolled in August 2008, when we had absolutely no reason to expect that the promising hiring data which induced us to attend law school might become irrelevant within a matter of months.  BigLaw (i.e., the tier of the largest, best-paying, most prestigious firms) more or less collapsed during our first semester.  Although the wider legal market might have been “oversaturated” even then, prior to mid-fall 2008, students at top law schools were explicitly told that there would be no dearth of high-paying entry level jobs. The only people who should worry, we were told, were those guys at the tier 4 schools. We were told that everyone who didn’t take a high-paying job upon graduation did so out of a desire to work in the public interest. This made sense; given that even those who planned to go into the private sector had to submit application essays about how we wanted to use our degrees to improve the world, you had to figure at least a handful of students were willing to forego a big paycheck in order to do work that they cared deeply about. When my class started to worry about how we would be affected by the onset of the recession, the schools continuously assured us that we would be “fine.” For a substantial percentage of the class of 2011, this has not proven true.\n\nI don't have quite as much sympathy for the classes that enrolled in 2009 and beyond, when there was clear evidence that things had changed, although you have to keep in mind that these enrollees were often being led over the cliff by assurances from very reputable schools that probably didn’t have a full grasp on the direness of the situation. None of the schools seemed willing to come to terms with how quickly the value of a degree could plummet, and even now there is a somewhat deluded mindset from school administrators (assuming they aren’t flat-out lying to keep themselves afloat). Courts have historically shown little sympathy for disappointed graduates who attempt to sue even tier 4 schools that have obviously misled enrollees about job prospects, so the administrators of top schools are essentially undeterred from continuing to misrepresent how their recent graduates are faring in the world, provided *U.S. News* doesn’t take them to task for their shady efforts to manipulate hiring data (e.g., temporarily hiring graduates to work in the school library so they can list them as “employed 9 months after graduation\"). ", "author": "OskarMao"}, {"body": "This man is good with words and stuff.", "author": "Iliketrainsandtrolls"}, {"body": "But what about the rapid rise of educational cost because there's virtually unfettered and open access to government-funded student loan options? The sluggish economy and our future prospects is one thing, but tuition costs have been going through the roof. This also puts our government in massive debt.\n\nWill you, and if so how, address the ballooning costs in education? Our economy can improve, but if year after year students are graduating with increasing debt, young people will perpetually in trouble.", "author": "freethemouse"}, {"body": "I think we just got Rampart-ed by the President of the United States.", "author": "juma606"}, {"body": "Did anyone else notice that the person who posted this has only been a redditor for 4 hours and this is the only thing they've ever posted? Coincidence? I think not. On the other hand, welcome to Reddit. ", "author": "xibi15"}, {"body": "But what about the rapid rise of educational cost because there's virtually unfettered and open access to government-funded student loan options? The sluggish economy and our future prospects are one thing, but tuition costs have been going through the roof. This also puts our government in massive debt.\n\nWill you, and if so how, address the ballooning costs in education while ensuring that everyone has access to it? Our economy can improve, but if year after year students are graduating with increasing debt, young people will perpetually in trouble.\n", "author": "freethemouse"}, {"body": "> more taxs cuts for the wealthy (paid for by raising tax burdens on the middle class and gutting investments like education)\n\nYou mean like the ones you [voted to extend](http://www.cbsnews.com/8301-503544_162-20026069-503544.html)?\n\n> getting rid of regulations we've put in place to control the excesses on wall street and help consumers\n\nAnd in your four years, why have you not bothered to address bringing back the Glass-Steagall Act, or any meaningful banking reforms?\n\n", "author": "pl213"}, {"body": "So sad that America has come to the point where we look to the government to get us a job.", "author": "Heelincal"}, {"body": ">Just want to say that George Bush took 8 years to wreck your country\n\nHe didnt take 8 year to wreck it...he was *given* 8 year to wreck it. We handed him that shit on a silver platter.", "author": "DankDarko"}, {"body": "Yes, I had a look and I saw it! Thanks for the tip anyway. :)\n\nIt is always nice when *they* (the real-life people who became memes somehow) not only acknowledge but also jokingly contribute to their own meme (like McKayla recently also did, for instance). That shows some sense of humour which apparently some other people lack.", "author": "aleowk"}, {"body": "He's got access to presidential bandwidth :)", "author": "pescetto"}, {"body": "He left before reddit even began to have load problems", "author": "Audaxx"}, {"body": "This too. This thing crippled reddit for about an hour and a half. Honestly, it's amazing that the President managed to get through enough to post what he did.", "author": "wote89"}, {"body": ">All candidates should get EQUAL air time, all candidates should get EQUAL money to spend as they will on advertisements and their campaign\n\n*All* candidates? Do you realize just how many presidential candidates there are? There is a nice little list [here](http://www.politics1.com/p2012.htm). In terms of advertising, if we assume that the total time advertisements are shown stays the same, that leaves next to no time for any individual candidate. To reform this, how would you solve the problem? Only give funding to certain parties candidates? That would be even worse that our current system. And that is saying something, because our current system is awful. This idea works in theory the same way our current system does.", "author": "Dudester_XCIC"}, {"body": "For the record, the french kinda do it that way.  Each candidate has equal amounts of money and advertising time.  ", "author": "mrkamikaze5"}, {"body": "Tell me about it.   I haven't gone a day without thinking about it and I have been home for almost three years now.", "author": "PTSDave"}, {"body": "We can go deeper.", "author": "TheDarkDoctor"}, {"body": "It's a shame he didn't answer. I'd have liked to see the response.", "author": "abdomino"}, {"body": "^ This. The concern is not that the internet will be closed or blocked in some way (though that can be a legitimate concern in some places), but that special interests or certain communities may try to place shackles upon the internet with the intention of \"protecting\" something, regardless of the consequences. The internet is a thriving community and has created much innovation and new culture. The concern is that people who do not understand the far reaching consequences of some of their decisions or understand some of the culture of the internet wield a lot of responsibility. Are there any policies in place or attempts being made to curb this type of thing?", "author": "kirillian"}, {"body": "http://i.imgur.com/986iq.jpg", "author": "MogusMaximus"}, {"body": "Dude what. I'm internetfamous now.", "author": "demaney"}, {"body": "I was very surprised by this as well! But I bet if the president wants a reddit name, there are ways of obtaining it...", "author": "geeze_louise"}, {"body": "POTUS_IN_MY_ANUS", "author": "Zalbu"}, {"body": "It's pretty funny because people used to get scolded for doing a request for Obama because he'd never do one. ", "author": "venividiikarma"}, {"body": "Your parents divorced because of *you*", "author": "MrRC"}, {"body": "Not really, let's be real here.\n\nAlthough it's funny to imagine President Obama sitting in the oval office giggling and looking at photos of cats.\n\nEDIT: I'm enjoying the fact that for the forseeable future my comment with the most upvotes will be one about President Obama looking at cat photos on reddit.\n\nDOUBLE EDIT: thanks to Machinax for pointing out that I'm quoted on CNN for this...I feel slightly more famous today, and yet I can't tell anyone I know IRL.", "author": "mimicthefrench"}, {"body": "Gooble Gabble Gooble Gabble.", "author": null}, {"body": "Meh, we already have universal health care, so w/e", "author": "spin0r"}, {"body": "*looks at a picture of Stephen Harper and Cries*\n\nFTFY", "author": "CanadiangirlEH"}, {"body": "**TL;DR @ bottom for the lazy**\n\nFirst off, hahaha. Secondly, considering there are literally zero negative repercussions bound to result from my statement; and considering that my statement is by no means sufficient to find me guilty of any crime in a court of law; and considering that the secret service, the NSA, DoHS, etc. have far better things to do than to track down and arrest a weed-smoking, pill-popping awesome-looking, master's degree holding, great job possessing, med-school bound dude from the Internet. So what I'm trying to say is I'm not doing anything crazy and it should take absolutely no courage for a rational person to post something like I did...... EVEN IN A PRESIDENT'S AMA. \n\nIn any case, if I do get dragged out of my house within the next few days by dudes in black suits and curly wires around their ears, I promise you guys an update. OP will actually deliver. I can make this promise because I know absolutely nothing will come of my post... I know most of you guys are kidding but at least some must be serious, and to those people I say: you have no understanding of how the legal system works.\n\nOn to more inportant matters now, haha — You, sir, are, in fact, the first person to ever make an image-macro/drawing/etc – that sort of thing for me. I truly feel like I've unlocked a reddit achievement. So thank you for that, friend. \n\n***TL;DR*** — **So many people saying I have balls for posting this. I mean, if posting something like this takes balls, then all the \"Ents\" on /r/trees, not to mention the users of /r/drugs, must have scrotums the size of laundry bags. Yeah yeah this is an Obama thread... But realistically, what does that change?**", "author": "GreatLookingGuy"}, {"body": "I'm assuming they'd be monitoring it for threats towards the president, not random pot smokers.", "author": "Nyrb"}, {"body": "Thank you for showing the president of the United States how classy us redditors can be.", "author": "jk01"}, {"body": "I bet the President up voted this. ", "author": "KingCarman"}, {"body": "I'm still waiting for learning cursive to pay off.", "author": "TheAtomicPlayboy"}, {"body": "Here's the response from the petition that was signed not too long ago.\n\n----\n\n**Doubling and Tripling What We Can Accomplish in Space**\n\n*By Phil Larson, a Communications and Space Policy Analyst at the White House Office of Science and Technology Policy*\n\nThank you for signing this petition. We share your view that NASA is a driver of innovation and economic growth, a creator of high-skilled and high-paying jobs, and a force for inspiration in the American people -- especially our youth. That's why President Obama has set NASA on course for a new and exciting chapter of American space exploration, one that will see more discoveries, scientific breakthroughs, and, ultimately, more Americans in space going to places never before visited.\n\nEven in the face of tough fiscal challenges, the President's plan charts a path towards continued American leadership in space by making every penny count. By investing in American companies -- and American ingenuity -- we are spurring free-market competition to give taxpayers more bang for the buck, while enabling NASA to do what it does best -- reach for the heavens.\n\nJust this past month, an historic -- and audacious -- event took place. For the first time, a privately owned American spacecraft launched and docked with the International Space Station (ISS) to deliver the cargo American astronauts need to do their jobs in space. This fundamentally new way of doing business for NASA includes partnering with innovative U.S. companies like SpaceX to embrace the efficiency, ingenuity, and resources of the private sector while allowing NASA to focus on challenges only its world-class scientists and engineers have the ability to tackle -- like sending humans beyond low Earth orbit for the first time in 40 years, outside the Earth-Moon system for the first time in history, and ultimately to explore Mars within the next couple of decades.\n\nNASA and space are so important to our future that we do need to be doubling and tripling what we can accomplish in this domain. That's why the President's plan for NASA more than doubles the number of U.S. rockets capable of going to the ISS. And the James Webb Space Telescope, which the President's Budget keeps on track for launch later this decade, won't just double Hubble's capabilities, but will be 100 times more powerful. This summer, Americans in a control room in California will be monitoring as an automobile-sized rover is lowered onto the Martian surface from a sky-crane hovering in the rusty atmosphere. The \"Curiosity\" Mars rover isn't just double the size of any previous rover -- but is also carrying 10 times the mass of scientific instruments as America's Opportunity rover currently operating on the surface. And with NASA's Kepler telescope currently in space, the number of planets identified as orbiting distant stars in other Solar Systems has not just been doubled, but multiplied several times over.\n\nThe Administration has worked with Congress over the last three years to develop a forward-leaning trajectory for NASA that places the agency on a more stable fiscal footing -- in part by joining forces with the private sector -- while still pushing the boundaries of inspiration and discovery. The key features of this plan include:\n\n* Extending operations of the ISS -- which has been continuously crewed since 2000 -- until at least 2020 (when President Obama came into office, it was scheduled to be decommissioned after 2015);\n* Acquiring crew and cargo transportation services to the ISS from U.S. commercial companies;\n* Pursuing new technology investments, like advanced in-space propulsion, to expand the reach, affordability, and potential of our space science and exploration efforts -- technologies that are required to send humans beyond the Moon;\n* Building the biggest, most powerful rocket ever -- set to be more powerful than the Saturn V vehicle that carried American astronauts to the Moon -- and cutting-edge crew capsule for deep space human exploration, including a mission to visit an asteroid in the 2020s and eventually Mars;\n* Leading the world in Earth and space science research vital to understanding our planetary home and unlocking the mysteries of our Solar System and the Universe.\n\nUnfortunately, not everyone is supportive of this ambitious effort. Rather than making bold, targeted investments in our space future and embarking on new partnerships with the private sector to ensure every taxpayer dollar is spent wisely, the proposed Republican House budget plan, if spread evenly, would significantly cut NASA's budget, forcing the deepest cuts to the space program since just after we landed on the Moon.\n\nEven in today's tight fiscal environment, the Administration has proposed a NASA budget for FY 2013 that spares the agency from such cuts and yet will deliver more than ever from this essential driver of American innovation.\n\nThank you for signing this petition and showing interest in our Nation's space program -- an interest key to sustaining support for programs at NASA and one we could not share more strongly. We encourage you to continue demanding more from our most creative science and technology agencies, and to appreciate that it is not just about how many dollars are spent on such lofty missions, but how effectively that money is spent to deliver results for the American people. We think NASA has never been stronger.", "author": "superfes"}, {"body": "So might you be suggesting, just maybe, that funding science and the advancement of civilization may be more important than dumping trillions of dollars into killing each other?", "author": "Procrasturbator11235"}, {"body": "I agree- American NEEDS a dare to be great moment, and they're ripe for the picking. Get off fossil fueled electricity, or commiting ourselves to having (and actually obtaining) the most streamlined effective government in the world, landing a man on mars. Hell, build *one nuclear power plant* and I'll be happy", "author": "goldandguns"}, {"body": "Ahaha... I can just see you telling everyone you know tonight \"I corrected the president on his grammar today.\"", "author": "OhRobots"}, {"body": "Damn. You now can add \"corrected the President's grammar\" to your resume. ", "author": "pchunter"}, {"body": "You're about to get a knock on your door. ", "author": "matt-383"}, {"body": "A grammar nazi's greatest dream... \n*\"an... Mr. President... An..\"*", "author": "TyluhS"}, {"body": "Even the president isn't safe of Reddit. ", "author": "DougSTL"}, {"body": "***http://i.imgur.com/C38NF.jpg***", "author": "Malplace"}, {"body": "How does it feel to correct the most influential man on the planet? ", "author": "Jhaawk"}, {"body": "That's it. Shows over folks. All the grammar nazis can go home now. Forever.", "author": null}, {"body": "The secret service will be at your door shortly. Remain calm and do not resist. ", "author": null}, {"body": "http://qkme.me/3qoszk", "author": "musketeer925"}, {"body": "President Obama doesn't know whether \"asteroid\" starts with a consonant or vowel!\n\n*More at 10, stay tuned to Fox*", "author": null}, {"body": "This was the highlight of your life, right?", "author": "whoosy"}, {"body": "If the president says it's a asteroid, it's a asteroid.", "author": "Ricksauce"}, {"body": "who the fuck has the gall to grammar nazi the President?\n\ns0crates82, thats who", "author": "Atheist101"}, {"body": "::Knock Knock::\n\n--Who's there--\n\n::An Secret Service Agent::", "author": "rugby411"}, {"body": "honestly, when you pressed \"save\" on that, did you just sit back and [smile](http://i.imgur.com/5ZEgi.jpg)?", "author": "secretvictory"}, {"body": "Reddit in a nutshell. The President of the most powerful nation in the world does an AMA, and reddit corrects his grammar.", "author": "NickTM"}, {"body": "Grammar Nazi Level: Legend. ", "author": "CoTripper"}, {"body": "A grammar nazi can wait his whole life and never get to correct the President of the United States. That must have felt great. ", "author": null}, {"body": "Reddit,  where correcting the President is considered acceptable.", "author": "camelBackNotation"}, {"body": "So how low do your balls hang?", "author": "Zarkx"}, {"body": "Dude you just corrected the president, notbad.jpg", "author": null}, {"body": "Grammar Nazis know no bounds. You've made me proud!", "author": "ratz30"}, {"body": "don't correct the President, neckbeard.", "author": "Whoa_Chill_Bro"}, {"body": "You now have the most awesome RES tag since the inception of RES.  \"Dude who corrected the presidents grammar\"", "author": "pacman404"}, {"body": "OH MY. Only opportunity you will ever get to do that. Ever.", "author": "fattehboi"}, {"body": "I smell an tax audit", "author": "david13z"}, {"body": "Socrates correcting President Obama. Quite appropriate. ", "author": "skeptik4life"}, {"body": "http://i.imgur.com/IoxFi.jpg", "author": "GoldenGraham12"}, {"body": "You done good, kn0thing, you done good.", "author": "redtaboo"}, {"body": "Spoken like a true ambassador, Alexis.\n\n[Bravo](http://assets0.ordienetworks.com/images/GifGuide/clapping/wethot.gif)", "author": "samsheffer"}, {"body": "Really good response. Too bad nobody will ever see it. Try posting it over at [r/moderatepolitics](http://www.reddit.com/r/moderatepolitics/)\n\nAlso html doesnt work in here.  Click on the \"Formatting Help\" to the bottom right of the dialog box for help.", "author": "taybme"}, {"body": "/reddit\n\nWE'RE DONE HERE.", "author": "bad_german"}, {"body": "President has earned an up vote this November. ", "author": "ivxSurgeon"}, {"body": "I died", "author": "beerob81"}, {"body": "You win everything sir, that was hilarious! XD  ", "author": "o2d"}, {"body": "I know nobody cares, but I must externalize that this comment is now at 1776 upvotes. God bless America.", "author": null}, {"body": "If this becomes...", "author": "mindtaker87"}, {"body": "$20 President Obama uses this for the campaign. Because that's a damn good meme, actually. ", "author": "I_am_PERRY"}, {"body": "I feel like this will cause a glitch in the matrix.", "author": "owmybrains"}, {"body": "I feel a disturbance in the force, as if millions of redditors were silenced in awe.", "author": "jugalator"}, {"body": "That's it people, we can log out now. Reddit is done.", "author": null}, {"body": "Gotta love a President that quotes his own meme", "author": null}, {"body": "I knew someone was going to do this meme, but never figured it to be the man himself ", "author": "heyguys274"}, {"body": "Dude, you can't reply to President Obama and type \"ejaculated\". Dick move bro.", "author": "ily112"}, {"body": "Hey. That's my boss. Don't use the \"E\" word. He'll think I'm a pervert for being part of this site... and then he'll block it on military networks. ", "author": "downfall88"}, {"body": "Fox News Headline: Obama posts on popular Child-Pornography hosting website.", "author": "Shit_Filled_Pussy"}, {"body": "Only on the Internet will someone actually respond to the president of the united states with, \"damn right you are\".", "author": "tartay745"}, {"body": "Necessary edit.", "author": null}, {"body": "you mean: damn right you are, Mr. President.", "author": "void702"}, {"body": "The secret service wouldn't appreciate you cursing towards POTUS\n", "author": "SuperSlyRy"}, {"body": "Your edit made my day.", "author": null}, {"body": "This may be the most appropriate use of this meme in reddit's history.", "author": "Baou"}, {"body": "This is such an appropriate image it practically makes my teeth hurt.", "author": "unusuallysuspect"}, {"body": "So, so relevant. ", "author": "plopliar"}, {"body": "Not only is it impressive to be upvoted more than the parent comment, you got upvoted more than *The President of the United States of America*. Congratulations.", "author": "undergroundmonorail"}, {"body": "Indeed, and it was a question of the utmost importance. ", "author": "bilbobangs"}, {"body": "'honoured'.....We've got a Canadian/Brit subverting our democratic process!!!", "author": "4horsepeople"}, {"body": "White house beer:\n\n\"It is tasty\"\n\n-Barack \"redditor\" Obama", "author": "Ryan_Firecrotch"}, {"body": "I'm always relieved the top comment isn't from POTATO_IN_MY_ANUS, something about that guy scares me..", "author": "ChrisQF"}, {"body": "As a member of the non-US free world. Did my vote get lost in the post?", "author": "jimmy17"}, {"body": "Let's stick to questions about the movie", "author": "everred"}, {"body": "He's going public with his white house beer", "author": "amps211"}, {"body": "I would use Obama cologne.", "author": null}, {"body": "[removed]", "author": null}, {"body": "[deleted]", "author": null}, {"body": "He should totally run for office. ", "author": "onanym"}, {"body": "I'm probably gonna vote for obama and all but hmlee is a redditor for 6 hours and got what looks to be a recited response... \n\nI'd go as far to say hmlee is someone in obama's camp and that they were chomping at the bit to please the average joe's of reddit. ", "author": "evrfighter"}, {"body": "Am I the only one that is kinda skeptical that ObAMA set up this question? All he's done on that account is set it up and ask the question, as soon as he made the account...?", "author": "OhMaaGodAmSoFatttttt"}, {"body": "Bad with paragraphs", "author": "KU76"}, {"body": "He is unbelievable with words. Unfortunately for our country the old proverb \"actions speak louder than words\" still applies. \n\nInb4: downvoted so hard reddit bans me permanently. ", "author": "Caracicatrice"}, {"body": "http://www.quickmeme.com/meme/3q95vf/", "author": "pritam_moodbidri"}, {"body": "I wish Obama would answer this one. Detailed.", "author": "MauritanianSponge"}, {"body": "So does Michelle.", "author": "rexington_"}, {"body": "Correct me if I'm wrong but it doesn't matter if you have a 1000 GB/s download speed, if the itself site is down you're gonna be seeing jack shit.", "author": "I_Will_Allow_This"}, {"body": "Upvotes, upvotes everywhere...\n", "author": "rockmn24"}, {"body": "I wish I had access to his presidential bandwidth.\n\nIF YOU KNOW WHAT I MEAN.", "author": "Daigeil"}, {"body": "I'm loving the idea that the president was sitting around frustrated by the 503s like any other redditor. Would have been even funnier if it resulted in a double post...", "author": "oreng"}, {"body": "I was wondering if somehow they gave his username priority access, or whether POTUS had to hit refresh.  \n\n\"These servers... are getting hammered!\"", "author": "fixessaxes"}, {"body": "I'm surprised he got the username PresidentObama.", "author": "xmod2"}, {"body": "TIL Roseanne Barr and a dude named Merlin are both running for president.", "author": "GESTICULATING_WILDLY"}, {"body": "Not only are there plenty of other nations who hold fully publicly funded elections, there are states and municipalities here in the US that do so. The point you bring up is an extremely good one, and absolutely must he addressed in a very clear way for people to have faith in this sort of system, but fortunately that work was done by those who went before us. \n\nNow, I'm not a political science if civics expert so I don't claim to know what all of the solutions which have been tried are, not which were more successful. I can say that the one system I know of for publicly funded elections involves a sort of primary system but not (as primaries would also have to be publicly funded else the bribery would just happen there). It essentially is that (to use a small example of a gubernatorial race) a candidate would have to prove that they have a significant amount of support in whatever jurisdiction they are running (in my example a state) to justify getting public monies. So for example there is an election to be held in North Dakota for governor and there are 15 people who wish to run. These people, by whatever deadline happens to be chosen, would be required to gather 5% of the voting populations signatures (% can be adjusted however the citizens choose) from each district in the jurisdiction, in this case 5% from each county in ND. Now that is the voting population, so it is 5% of the total number of voters in the previous governors election (even if there are 5 million citizens but only 500,000 voted, they would only need 25,000 signatures). This demonstrates that there is enough citizen support for that person to be a serious candidate without setting the bar so high that only the major parties can clear it. \n\nNow that works in state and local elections, because the total number of signatures and amount if ground is limited so no huge sum if money must be spent to gather the signatures. But it wouldn't work for presidential elections because it would still cost many 10's of millions to get that many signatures from every state in the nation. So on that I don't know specifically what a national system may look like, I do know they exist in most countries but I haven't read enough to know the details. ", "author": "feynmanwithtwosticks"}, {"body": "Here, [borrow our legislation and rules](http://stakeholders.ofcom.org.uk/broadcasting/guidance/programme-guidance/ppbrules/).\n\nIn short, in the UK political advertising is illegal. Instead, in return for having part of the public airwaves given to them under license, as part of that license they must agree to air 5-minute long party political broadcasts now and again.\n\nThere is a small flaw in this, in that who gets allocated air time is based primarily on previous election results, but even the smaller and more bizarre parties can [get air time](http://www.youtube.com/watch?v=438UKM1Av1g) if at least some people vote for them.\n\nUK politics has its money issues, but a general election costs considerably less here per capita than it does in the US, and we have relatively little negative campaigning. That's also helped by the fact we don't adhere to a strict calendar of elections either - overall it's a *much* calmer process.\n\nRight now there are plans for all parties to be funded by the taxpayer based on previous election results, so a new party only needs to be \"seed funded\" in essence - if it's popular, it will get public money. I don't like the idea as it props up political parties rather than independently minded politicians who want to represent their constituencies better, but it's a model being discussed.\n\nSo, you know, there are ways to do this everywhere.", "author": "p7r"}, {"body": "Right, we better just keep it to two... ", "author": null}, {"body": "Overturning Citizens United would go a long way toward returning at least some balance and transparency to campaign finance.  That's a start.  For the long haul, it's perfectly reasonable to cap private spending in primary races and then allot a set amount for the winners of primaries.  \nThis might also take us away from the existing two party system that is sucking the life out of our infrastructure.", "author": "idgyT"}, {"body": "I've been home for 7. I picked a day of the year that no one else is celebrating for any reason that was important to me and what happened to me there. I take it off every year so I can do something for myself without having to compete with any of the military holidays or making myself known. It helps and things get better. You have my best wishes.", "author": "SteelCrossx"}, {"body": "I'm sorry, man :(\n\nIf you live in NYC, I'll buy you a beer.", "author": "pirateg3cko"}, {"body": "I saw", "author": "the_recluse"}, {"body": "Can I take this moment to point out how the lack of back and forth here makes this entire event a *pointless* and empty gesture? It's just another campaign stop where he can hit all the talking points and say whatever he wants to say because there is no actual dialog taking place. The lack of that kind of critical conversation is why our politicians are so worthless today, and it is why they do not respect the power of the people, but simply pander to it.\n\nThe debates are a joke too. Lies just beget more lies and people who are all to eager to succumb to the fallacy of moderation. There need to be *real* conversations going on between our politicians and our public servants, instead of our public servants and the lobbyists that corporations pour millions of dollars into.\n\nDoes every American citizen need to be able to afford to pay a liaison to live in D.C. and speak on their behalf?\n\nThis is a god damned joke. Election day is not on its way, it's False Dichotomy Day -- neither of the people on the ballot are the right people for the job, but people pretend as if they're deciding who the right person for the job is nonetheless.", "author": "thingandstuff"}, {"body": "I would have liked to hear an answer to that as well.", "author": "I_want_fun"}, {"body": "[deleted]", "author": null}, {"body": "This whole thing is just as staged as the presidential debates. So long as he can choose the questions he answers, he can do no wrong.", "author": "Dark_Souls"}, {"body": "Is that Socks?", "author": "kittywitch9"}, {"body": "Those fuckers didn't even credit your username!  I would write a strongly worded letter to them and burn it under their balls.", "author": "TechnoL33T"}, {"body": "hahaha that's nuts ", "author": "organicremedies"}, {"body": "Actually, it was taken back in [2009](http://web.archive.org/web/20090221153248/http://www.reddit.com/user/PresidentObama).", "author": "LeadStark"}, {"body": "I can just see the guy who had the username trying to log in and receive an error message of the sort \"You're username has been changed to IamnotPresidentObamaILied due to the fact that the real President Obama would like to Join our community. Thanks, Reddit Staff!!\"", "author": "MrB1ond3"}, {"body": "that would be the first lady's", "author": "didnotwanttoregister"}, {"body": "AMA Request: God.", "author": "RandoAtReddit"}, {"body": "To be fair, an AMA request for the President of the United States is a little ridiculous. This is one of those things that just has to happen on its own.", "author": null}, {"body": "I'm pretty sure Obama used to be in the sidebar under the \"no unrealistic requests\" rule. \n\nNow it just says God. ", "author": "gotrees"}, {"body": "This just in: Jolly Ranchers and Doritos are now illegal by presidential decree. ", "author": "ScampAndFries"}, {"body": "If Obama made a \"Nobody cares Apostolate\" post, I would retire from reddit, realizing that nothing would ever top seeing that.\n", "author": "fronteir"}, {"body": "\"We Redditors\", not \"us Redditors\".\n\nMr. Obama, I think we need better education in this country.", "author": "Pavel_Komarov"}, {"body": "And \"you won't always have a calculator with you\". \nSent from my iPhone ", "author": "tuckidge"}, {"body": "Livin' the dream...", "author": "grammar_is_optional"}, {"body": "... \"a comet\" ... no, that should really be \"asteroid\" ... did I change \"a\" to \"an\" ... ah, no one will notice ...", "author": "MaeveningErnsmau"}, {"body": "I'm telling everyone tonight, i bought the US president a gift today. :-) http://imgur.com/a/ZCsng", "author": "AJER_AJER"}, {"body": ">\"I corrected the president's intern\n\nFTFY", "author": "JorusC"}, {"body": "I read this, and immediately got a knock on the door. \n\nShit myself.\n\nFound myself eating pizza 2 minutes later.", "author": "MUNCHB0X"}, {"body": "THE PRESIDENT IS THE ONE WHO KNOCKS", "author": "felatedbirthday"}, {"body": "\"Hmm, what was the greatest moment of my life? Well, I once corrected the President of the United States, does that count?\"", "author": "apowsawce"}, {"body": "It ... It almost brings a tear to my eye. It's been my dream for so many years.", "author": "Arrowofdarkness"}, {"body": "http://i.imgur.com/IYCsF.gif", "author": "boqueno"}, {"body": "I'm a total grammar nazi.  My favorite joke:\n\nKnock, knock...\nWho's there?\nTo...\nTo, who?\nTo WHOM...\n", "author": "Annie225"}, {"body": "\"from\" Reddit ", "author": null}, {"body": "*safe from\n\nAnd neither are you.", "author": null}, {"body": "All right, but first let me lecture you on sentence structure...", "author": "patashn1k"}, {"body": "R.I.P, Socrates82.", "author": "frogger2504"}, {"body": "The president may be black, but he's not Will Smith. He can't get away with that!", "author": "redditor_since"}, {"body": "This is the best grammar nazi-ing he will ever get in his life. Correcting the sitting president of the united states. Let him live the dream.", "author": "vadergeek"}, {"body": "And s0crates82 was *never seen agai^nn^nn*...", "author": "uberced"}, {"body": "Let's just be thankful the guy that corrected him didn't have a screenname like i_rape_cats", "author": "kavorka2"}, {"body": "The rules of grammar apply to all men, be they president or peon.", "author": "ressMox"}, {"body": "Aw, c'mon. You gotta admit, \"I corrected The President, AMA\" would be pretty funny.", "author": "mexipimpin"}, {"body": "You have been quoted by CNN.", "author": "loldudester"}, {"body": "Grammar correction is the highest form of patriotism.", "author": "Pixeleyes"}, {"body": "Are you kidding me? Life achievement unlocked: \"grammar-nazied the President\"", "author": "pchunter"}, {"body": "President makes a typo, a stranger on the internet corrects him. Another stranger tells him to stop. EDIT: Second stranger *deletes his post*. The conspiracy crowd is probably already running with this.", "author": "Mostly_Invisible_Man"}, {"body": "Whoa...chill bro.", "author": null}, {"body": "He's the president not a king\n", "author": "seth7o5"}, {"body": "You could try reposting this to r/bestof. If it's really him this is definitely bestof material, especially since he got only 8 upvotes and he's responding directly to the big \"elephant in the room\" of this thread which everybody else was disappointed that the president had ignored.", "author": "angrybrother273"}, {"body": "Pack it up people, our job is done.", "author": "senorsandman"}, {"body": "</reddit>\n\nFTFY", "author": null}, {"body": "THE INTERNET IS OVER! EVERYBODY OUT!", "author": "okadery"}, {"body": "actually it was caused by 503's", "author": "embretr"}, {"body": "Looks like we got a badass over here", "author": "bru_tech"}, {"body": "I wasn't aware other presidents had memes.", "author": "EdotRdotJ"}, {"body": "I'm not gonna lie, it gave me chills and made me smile.  ", "author": null}, {"body": "He was being cocky.", "author": "warrenlain"}, {"body": "Well, it's not an Ear move is it?", "author": null}, {"body": "He's probably dead now.", "author": "OmegaSnowWolf"}, {"body": "Joe Biden?", "author": "Wordlessly"}, {"body": "And get upvoted more than the POTUS.", "author": "HiImDan"}, {"body": "That's Dr. Mr. Professor President to you.", "author": "mr_mojo773"}, {"body": "mi lord", "author": "StarkofWinterfell"}, {"body": "[deleted]", "author": null}, {"body": "Indubitably.", "author": "onedrummer2401"}, {"body": "Cool! Where are you from?  Guam? Puerto Rico? Virgin Islands?", "author": null}, {"body": "I was wondering when we were going to get to the rampart jokes. ", "author": "weekendofsound"}, {"body": "[removed]", "author": null}, {"body": "PresidentObama for President!!", "author": null}, {"body": "Maybe start small, like a senator or something", "author": "bru_tech"}, {"body": "\"Invest in science.\" Swoon.", "author": "MoistVirginia"}, {"body": "Candidate Obama is pretty awesome, and it would be nice if President Obama were more like him.", "author": "Kind_Of_A_Dick"}, {"body": "Absolutely, I was looking to post the same thing, but saw that you already did, hmlee definitely looks like a plant", "author": "happydish"}, {"body": "Wait... you mean ~~people~~ presidents lie on the internet?", "author": "sharkiness"}, {"body": "Proof that even the POTUS is not immune to grammar Nazis.", "author": "mycakeday"}, {"body": "He can't. His PR peoples didn't plant this. ", "author": null}, {"body": "PRESIDENTIAL BANDWIDTH!! *hand waving*", "author": "Zeroe"}, {"body": "Am I the only one that read every one of his posts in his voice?", "author": "ActuallyNotRetarded"}, {"body": "It's an HTTP header defined in RFC 2616:\n\n    X-Let-Me-Through-I-Am-The-President-Of-The-United-States: True", "author": null}, {"body": "Bah! [Vermin Supreme is the clear choice](http://www.youtube.com/watch?v=4d_FvgQ1csE), that guy is a genius.", "author": "RobbieGee"}, {"body": "I'd vote for a dude named Merlin if he went all out with the wizard hat and star spangled blue pajamas.", "author": "nightwing2024"}, {"body": "You just described the Presidential Campaign Fund. The only problem is that we can't make it mandatory, so when Barack Obama ran in 2008 and opted to not take public funds and the spending restrictions that came with it and was able to raise a lot more as a result it kind of killed that.", "author": "The_Tic-Tac_Kid"}, {"body": "Plot twist: actually crazed murder.", "author": "thestickystickman"}, {"body": "Yes it is! RIP socks.\n\nFirst kitty under Clinton for those who don't know :)", "author": "DoctorBarbie89"}, {"body": "He was reading this.", "author": null}, {"body": "Hidden gem.  Truly.", "author": "Hedgehog_Mist"}, {"body": "Oh, oh god. Post of the week.", "author": "RoflCopter4"}, {"body": "That would be glorious. Imagine if he did that in a video. ", "author": "ssbbnitewing"}, {"body": "Funny thing is he would have to declare that as a gift in his tax form. You pretty much  made it into history! (as a minor footnote to a footnote)", "author": null}, {"body": "\"\nFTFY", "author": "Ralfnader66"}, {"body": "Did you clean up the shit first?", "author": null}, {"body": "A riveting story...\nI laughed, I cried, I came.\n10/10", "author": "Lottanubs"}, {"body": "[Ahaha. You found my mistake. That was done intentionally; you have passed.](http://a.scpr.org/i/fb400c14fc725bfedb7401a9c3728b69/46251-six.jpg)", "author": "firedragonxx9832"}, {"body": "I think you forgot your punctuations.  Grammar NOTzi", "author": "mkr7"}, {"body": "And the history books will read \"it is rumored President Obama was bullied about his grammar in an 'internet forum' and from that encounter began to destroy what was once known as the internet\"", "author": "goldandguns"}, {"body": "you mean disappointed. it should have been POTUS_IN_MY_ANUS", "author": "visaisahero"}, {"body": "We had a good run, but its time to move on.", "author": "TisJokar"}, {"body": "Hold on now, we still gotta get Romney to acknowledge the [\"Relatable Romney\"](http://weknowmemes.com/wp-content/uploads/2012/07/relateable-romney-meme-bank.jpeg) meme!", "author": null}, {"body": "..I want to watch the credits roll, and I need to finish my drink. Give me a minute!", "author": "fauxpunk"}, {"body": "[hehe](http://cdn.memegenerator.net/instances/400x/25574330.jpg)", "author": "theshinepolicy"}, {"body": "I think the White House would be happy to know Biden's only into reddit. It might keep him busy enough not to talk to the press, and the worst leak that might come out of it is to know Biden's subscribed to /r/mylittlepony or /r/gonewild. ", "author": "TeslaIsAdorable"}, {"body": "Pretty hard to upvote people outside of the internet. I hear they send people to prison for flinging pointed arrow-y things at Presidents.", "author": "Subbuteo"}, {"body": "I don't understand why people keep downvoting the PRESIDENT. Jeez. His IAmA has over 207 *thousand* downvotes.", "author": "SerTapsaHenrick"}, {"body": "You're a highborn. You say my lord, not mi lord. ", "author": "TheOneWhoKnocksBitch"}, {"body": "not bad!", "author": "dariusbatista"}, {"body": "What if he doesn't get elected, that would be one awkward username", "author": "ToSlowImPro"}, {"body": "And once he becomes President we can sell his seat in the Senate!", "author": "Jvaccaro"}, {"body": "[Obligatory.](http://i1.kym-cdn.com/photos/images/original/000/372/645/731.gif)", "author": "erwinthehamsandwich"}, {"body": "[deleted]", "author": null}, {"body": "That completely makes sense now", "author": "T_Miller"}, {"body": "no my good man, you are not.", "author": "goodknee"}, {"body": "Not in the slightest.", "author": "wote89"}, {"body": "I hope not.", "author": "didnotwanttoregister"}, {"body": "That would be a lot of work though...", "author": "senorsandman"}, {"body": "What and let the pizza get cold?", "author": "scared2mosh"}, {"body": "That sounds like the motto of the internet and an homage to Julius Caesar: Risi, flevi, veni.", "author": "everflow"}, {"body": "Pack up the accounts, you too Apostolate. Yes, and the novelties. Our journey has reached its end. ", "author": null}, {"body": "and SkyNet!! We haven't even started on SkyNet yet!", "author": "Flawd_MA"}, {"body": "... holding out for that extra scene at the end", "author": "well_welp_ok"}, {"body": "Well, once. You took office twice, though.", "author": null}, {"body": "might be the funniest and the saddest thing ever...", "author": "Aazum"}, {"body": "Biden is the violentacrez. ", "author": "drgradus"}, {"body": "I'll drink to that!", "author": "vteckickedin"}, {"body": "They're not the ones you were looking for.  I know because a nice old guy in a robe told me.", "author": "IameAuhSomme"}, {"body": "Especially in two minutes.  Hardly enough time to clean thoroughly, put shat-upon clothes in the wash, change, answer the door, and start eating.\n\n*Which corners were cut*, sir?  Inquiring minds want to know!", "author": "solistus"}, {"body": "Move out. ", "author": "CronosDage"}, {"body": "Commenting to be in historical thread.", "author": "Stenzy"}]